-- MariaDB dump 10.19  Distrib 10.4.32-MariaDB, for Win64 (AMD64)
--
-- Host: 127.0.0.1    Database: sinkyu_massage_system_db
-- ------------------------------------------------------
-- Server version	10.4.32-MariaDB

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `assistance_levels`
--

DROP TABLE IF EXISTS `assistance_levels`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `assistance_levels` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `created_at` datetime NOT NULL DEFAULT current_timestamp(),
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `assistance_level` varchar(255) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=22 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='要介助度';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `assistance_levels`
--

LOCK TABLES `assistance_levels` WRITE;
/*!40000 ALTER TABLE `assistance_levels` DISABLE KEYS */;
INSERT INTO `assistance_levels` VALUES (1,'2025-09-12 13:14:57','2025-09-12 13:15:18','要介助'),(2,'2025-09-12 13:14:57','2025-09-12 13:15:31','全介助'),(3,'2025-09-12 13:14:57','2025-09-12 13:15:31','部分介助'),(4,'2025-09-12 13:14:57','2025-09-12 13:15:31','中等度介助'),(5,'2025-09-12 13:14:57','2025-09-12 13:15:31','中等度以上の介助又は不能'),(6,'2025-09-12 13:14:57','2025-09-12 13:15:31','要監視又は軽監視'),(7,'2025-09-12 13:14:57','2025-09-12 13:15:31','車椅子使用'),(8,'2025-09-12 13:14:57','2025-09-12 13:15:31','自立'),(9,'2025-09-12 13:14:57','2025-09-12 13:15:31','昼夜問わず自立');
/*!40000 ALTER TABLE `assistance_levels` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bill_categories`
--

DROP TABLE IF EXISTS `bill_categories`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bill_categories` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `created_at` datetime NOT NULL DEFAULT current_timestamp(),
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `bill_category` varchar(255) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='請求区分';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bill_categories`
--

LOCK TABLES `bill_categories` WRITE;
/*!40000 ALTER TABLE `bill_categories` DISABLE KEYS */;
INSERT INTO `bill_categories` VALUES (1,'2025-09-08 12:06:05','2025-09-08 12:06:05','新規'),(2,'2025-09-10 11:37:41','2025-09-10 11:37:41','継続');
/*!40000 ALTER TABLE `bill_categories` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bodyparts`
--

DROP TABLE IF EXISTS `bodyparts`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bodyparts` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `created_at` datetime NOT NULL DEFAULT current_timestamp(),
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `bodypart` varchar(255) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=19 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='身体部位';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bodyparts`
--

LOCK TABLES `bodyparts` WRITE;
/*!40000 ALTER TABLE `bodyparts` DISABLE KEYS */;
INSERT INTO `bodyparts` VALUES (1,'2025-09-05 11:38:41','2025-09-05 11:38:41','trunk'),(2,'2025-09-05 11:38:41','2025-09-05 11:38:41','upper_limb_r'),(3,'2025-09-05 11:38:41','2025-09-05 11:38:41','upper_limb_l'),(4,'2025-09-05 11:38:41','2025-09-05 11:38:41','lower_limb_r'),(5,'2025-09-05 11:38:41','2025-09-05 11:38:41','lower_limb_l'),(6,'2025-09-05 11:38:41','2025-09-05 11:38:41','shoulder_r'),(7,'2025-09-05 11:38:41','2025-09-05 11:38:41','shoulder_l'),(8,'2025-09-05 11:38:41','2025-09-05 11:38:41','elbow_r'),(9,'2025-09-05 11:38:41','2025-09-05 11:38:41','elbow_l'),(10,'2025-09-05 11:38:41','2025-09-05 11:38:41','wrist_r'),(11,'2025-09-05 11:38:41','2025-09-05 11:38:41','wrist_l'),(12,'2025-09-05 11:38:41','2025-09-05 11:38:41','coxa_r'),(13,'2025-09-05 11:38:41','2025-09-05 11:38:41','coxa_l'),(14,'2025-09-05 11:38:41','2025-09-05 11:38:41','knee_r'),(15,'2025-09-05 11:38:41','2025-09-05 11:38:41','knee_l'),(16,'2025-09-05 11:38:41','2025-09-05 11:38:41','ankle_r'),(17,'2025-09-05 11:38:41','2025-09-05 11:38:41','ankle_l'),(18,'2025-09-08 13:32:20','2025-09-08 13:32:20','others');
/*!40000 ALTER TABLE `bodyparts` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bodyparts-consents_massage`
--

DROP TABLE IF EXISTS `bodyparts-consents_massage`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bodyparts-consents_massage` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `created_at` datetime NOT NULL DEFAULT current_timestamp(),
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `consents_massage_id` int(11) NOT NULL,
  `symtom_1_bodyparts_id` int(11) DEFAULT NULL,
  `symtom_2_bodyparts_id` int(11) DEFAULT NULL,
  `therapy_type_1_bodyparts_id` int(11) DEFAULT NULL,
  `therapy_type_2_bodyparts_id` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `cdh_massage_bodyparts_cdh_massage_FK` (`consents_massage_id`),
  KEY `concenting_doctor_history_massage_bodyparts_bodyparts_FK` (`symtom_1_bodyparts_id`),
  KEY `concenting_doctor_history_massage_bodyparts_bodyparts_FK_1` (`symtom_2_bodyparts_id`),
  KEY `concenting_doctor_history_massage_bodyparts_bodyparts_FK_2` (`therapy_type_1_bodyparts_id`),
  KEY `concenting_doctor_history_massage_bodyparts_bodyparts_FK_3` (`therapy_type_2_bodyparts_id`),
  CONSTRAINT `cdh_massage_bodyparts_cdh_massage_FK` FOREIGN KEY (`consents_massage_id`) REFERENCES `consents_massage` (`id`),
  CONSTRAINT `concenting_doctor_history_massage_bodyparts_bodyparts_FK` FOREIGN KEY (`symtom_1_bodyparts_id`) REFERENCES `bodyparts` (`id`),
  CONSTRAINT `concenting_doctor_history_massage_bodyparts_bodyparts_FK_1` FOREIGN KEY (`symtom_2_bodyparts_id`) REFERENCES `bodyparts` (`id`),
  CONSTRAINT `concenting_doctor_history_massage_bodyparts_bodyparts_FK_2` FOREIGN KEY (`therapy_type_1_bodyparts_id`) REFERENCES `bodyparts` (`id`),
  CONSTRAINT `concenting_doctor_history_massage_bodyparts_bodyparts_FK_3` FOREIGN KEY (`therapy_type_2_bodyparts_id`) REFERENCES `bodyparts` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=93 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='M:N型リレーション中間テーブル（身体部位 − 同意医師履歴(あんま・マッサージ)）';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bodyparts-consents_massage`
--

LOCK TABLES `bodyparts-consents_massage` WRITE;
/*!40000 ALTER TABLE `bodyparts-consents_massage` DISABLE KEYS */;
INSERT INTO `bodyparts-consents_massage` VALUES (81,'2026-02-26 13:56:57','2026-02-26 13:56:57',17,2,NULL,NULL,NULL),(82,'2026-02-26 13:56:57','2026-02-26 13:56:57',17,NULL,NULL,2,NULL),(83,'2026-02-27 10:56:05','2026-02-27 10:56:05',18,5,NULL,NULL,NULL),(84,'2026-02-27 10:56:05','2026-02-27 10:56:05',18,NULL,6,NULL,NULL),(85,'2026-02-27 10:56:05','2026-02-27 10:56:05',18,NULL,12,NULL,NULL),(86,'2026-02-27 10:56:05','2026-02-27 10:56:05',18,NULL,13,NULL,NULL),(87,'2026-02-27 10:56:05','2026-02-27 10:56:05',18,NULL,NULL,5,NULL),(88,'2026-02-27 10:56:05','2026-02-27 10:56:05',18,NULL,NULL,4,NULL),(89,'2026-02-27 10:56:05','2026-02-27 10:56:05',18,NULL,NULL,NULL,2),(90,'2026-02-27 10:56:05','2026-02-27 10:56:05',18,NULL,NULL,NULL,3),(91,'2026-02-27 10:56:05','2026-02-27 10:56:05',18,NULL,NULL,NULL,4),(92,'2026-02-27 10:56:05','2026-02-27 10:56:05',18,NULL,NULL,NULL,5);
/*!40000 ALTER TABLE `bodyparts-consents_massage` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bodyparts-records`
--

DROP TABLE IF EXISTS `bodyparts-records`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bodyparts-records` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'Primary Key',
  `created_at` datetime NOT NULL DEFAULT current_timestamp(),
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `records_id` int(11) NOT NULL,
  `therapy_type_bodyparts_id` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `bodyparts_records_records_FK` (`records_id`),
  KEY `bodyparts_records_bodyparts_fk` (`therapy_type_bodyparts_id`),
  CONSTRAINT `bodyparts_records_bodyparts_fk` FOREIGN KEY (`therapy_type_bodyparts_id`) REFERENCES `bodyparts` (`id`),
  CONSTRAINT `bodyparts_records_records_FK` FOREIGN KEY (`records_id`) REFERENCES `records` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=182 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='M:N型リレーション中間テーブル（身体部位 − 実績データ）';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bodyparts-records`
--

LOCK TABLES `bodyparts-records` WRITE;
/*!40000 ALTER TABLE `bodyparts-records` DISABLE KEYS */;
INSERT INTO `bodyparts-records` VALUES (109,'2025-12-09 11:47:46','2025-12-09 11:47:46',51,2),(110,'2025-12-09 11:47:46','2025-12-09 11:47:46',51,4),(111,'2025-12-09 11:47:46','2025-12-09 11:47:46',51,5),(112,'2025-12-09 11:47:46','2025-12-09 11:47:46',52,2),(113,'2025-12-09 11:47:46','2025-12-09 11:47:46',52,4),(114,'2025-12-09 11:47:46','2025-12-09 11:47:46',52,5),(115,'2025-12-09 11:47:46','2025-12-09 11:47:46',53,2),(116,'2025-12-09 11:47:46','2025-12-09 11:47:46',53,4),(117,'2025-12-09 11:47:46','2025-12-09 11:47:46',53,5),(118,'2025-12-09 15:42:37','2025-12-09 15:42:37',55,2),(119,'2025-12-09 15:42:37','2025-12-09 15:42:37',55,4),(120,'2025-12-09 15:42:37','2025-12-09 15:42:37',55,5),(121,'2025-12-09 15:42:37','2025-12-09 15:42:37',56,2),(122,'2025-12-09 15:42:37','2025-12-09 15:42:37',56,4),(123,'2025-12-09 15:42:37','2025-12-09 15:42:37',56,5),(124,'2025-12-09 15:42:37','2025-12-09 15:42:37',57,2),(125,'2025-12-09 15:42:37','2025-12-09 15:42:37',57,4),(126,'2025-12-09 15:42:37','2025-12-09 15:42:37',57,5),(127,'2025-12-09 15:42:37','2025-12-09 15:42:37',58,2),(128,'2025-12-09 15:42:37','2025-12-09 15:42:37',58,4),(129,'2025-12-09 15:42:37','2025-12-09 15:42:37',58,5),(130,'2025-12-09 15:42:37','2025-12-09 15:42:37',59,2),(131,'2025-12-09 15:42:37','2025-12-09 15:42:37',59,4),(132,'2025-12-09 15:42:37','2025-12-09 15:42:37',59,5),(133,'2025-12-09 15:42:37','2025-12-09 15:42:37',60,2),(134,'2025-12-09 15:42:37','2025-12-09 15:42:37',60,4),(135,'2025-12-09 15:42:37','2025-12-09 15:42:37',60,5),(136,'2025-12-09 15:42:37','2025-12-09 15:42:37',61,2),(137,'2025-12-09 15:42:37','2025-12-09 15:42:37',61,4),(138,'2025-12-09 15:42:37','2025-12-09 15:42:37',61,5),(139,'2025-12-09 15:42:37','2025-12-09 15:42:37',62,2),(140,'2025-12-09 15:42:37','2025-12-09 15:42:37',62,4),(141,'2025-12-09 15:42:37','2025-12-09 15:42:37',62,5),(142,'2025-12-09 15:42:37','2025-12-09 15:42:37',63,2),(143,'2025-12-09 15:42:37','2025-12-09 15:42:37',63,4),(144,'2025-12-09 15:42:37','2025-12-09 15:42:37',63,5),(145,'2025-12-09 15:42:37','2025-12-09 15:42:37',64,2),(146,'2025-12-09 15:42:37','2025-12-09 15:42:37',64,4),(147,'2025-12-09 15:42:37','2025-12-09 15:42:37',64,5),(148,'2025-12-13 13:43:14','2025-12-13 13:43:14',75,1),(149,'2025-12-13 13:43:15','2025-12-13 13:43:15',75,3),(156,'2026-01-09 11:48:31','2026-01-09 11:48:31',91,1),(157,'2026-01-09 11:48:31','2026-01-09 11:48:31',91,3),(158,'2026-01-09 11:48:31','2026-01-09 11:48:31',91,4),(159,'2026-01-09 11:48:31','2026-01-09 11:48:31',92,1),(160,'2026-01-09 11:48:31','2026-01-09 11:48:31',92,3),(161,'2026-01-09 11:48:31','2026-01-09 11:48:31',92,4),(162,'2026-01-10 12:48:00','2026-01-10 12:48:00',102,2),(163,'2026-02-10 10:26:01','2026-02-10 10:26:01',110,2),(164,'2026-02-10 10:26:01','2026-02-10 10:26:01',110,3),(165,'2026-02-10 10:28:37','2026-02-10 10:28:37',111,1),(166,'2026-02-10 10:30:02','2026-02-10 10:30:02',112,1),(167,'2026-02-10 10:31:27','2026-02-10 10:31:27',113,2),(168,'2026-02-10 10:31:27','2026-02-10 10:31:27',113,3),(169,'2026-02-10 10:31:27','2026-02-10 10:31:27',113,4),(170,'2026-02-10 10:31:27','2026-02-10 10:31:27',113,5),(171,'2026-02-10 10:43:55','2026-02-10 10:43:55',116,1),(172,'2026-02-10 10:43:55','2026-02-10 10:43:55',116,2),(173,'2026-02-10 10:43:55','2026-02-10 10:43:55',116,3),(174,'2026-02-10 10:43:55','2026-02-10 10:43:55',116,4),(175,'2026-02-10 10:43:55','2026-02-10 10:43:55',116,5),(176,'2026-02-10 13:49:30','2026-02-10 13:49:30',117,1),(177,'2026-02-10 13:49:30','2026-02-10 13:49:30',117,5),(178,'2026-02-10 13:49:52','2026-02-10 13:49:52',118,1),(179,'2026-02-10 13:49:52','2026-02-10 13:49:52',118,2),(180,'2026-02-10 13:49:52','2026-02-10 13:49:52',118,3),(181,'2026-02-10 14:19:12','2026-02-10 14:19:12',119,3);
/*!40000 ALTER TABLE `bodyparts-records` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `caremanagers`
--

DROP TABLE IF EXISTS `caremanagers`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `caremanagers` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `created_at` datetime NOT NULL DEFAULT current_timestamp(),
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `last_name` varchar(255) DEFAULT NULL,
  `first_name` varchar(255) DEFAULT NULL,
  `last_name_kana` varchar(255) DEFAULT NULL,
  `first_name_kana` varchar(255) DEFAULT NULL,
  `service_providers_id` int(11) DEFAULT NULL,
  `postal_code` varchar(255) DEFAULT NULL,
  `address_1` varchar(255) DEFAULT NULL,
  `address_2` varchar(255) DEFAULT NULL,
  `address_3` varchar(255) DEFAULT NULL,
  `phone` varchar(255) DEFAULT NULL,
  `cell_phone` varchar(255) DEFAULT NULL,
  `fax` varchar(255) DEFAULT NULL,
  `email` varchar(255) DEFAULT NULL,
  `note` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `caremanagers_service_providers_FK` (`service_providers_id`),
  CONSTRAINT `caremanagers_service_providers_FK` FOREIGN KEY (`service_providers_id`) REFERENCES `service_providers` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='ケアマネ';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `caremanagers`
--

LOCK TABLES `caremanagers` WRITE;
/*!40000 ALTER TABLE `caremanagers` DISABLE KEYS */;
INSERT INTO `caremanagers` VALUES (1,'2025-11-14 10:42:05','2025-12-08 15:24:47','AAAAA','','AAAAA','',NULL,'880-0002','宮崎県','宮崎市中央通','AAAAA','00000','00000','00000','AAAAA@AAAAA','AAAAA'),(2,'2025-11-14 10:50:16','2025-12-08 15:24:47','AAAAA','','AAAAA','',3,'880-0002','宮崎県','宮崎市中央通','AAAAA','00000','00000','00000','AAAAA@AAAAA','AAAAA'),(3,'2025-11-14 10:55:04','2025-12-08 15:24:47','AAAAA','',NULL,'',2,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL);
/*!40000 ALTER TABLE `caremanagers` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `clinic_info`
--

DROP TABLE IF EXISTS `clinic_info`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `clinic_info` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `created_at` datetime NOT NULL DEFAULT current_timestamp(),
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `clinic_name` varchar(255) NOT NULL,
  `owner_last_name` varchar(255) DEFAULT NULL,
  `owner_first_name` varchar(255) DEFAULT NULL,
  `owner_birthday` date DEFAULT NULL,
  `postal_code` varchar(255) NOT NULL,
  `address_1` varchar(255) NOT NULL,
  `address_2` varchar(255) NOT NULL,
  `address_3` varchar(255) NOT NULL,
  `phone` varchar(255) NOT NULL,
  `cellphone` varchar(255) DEFAULT NULL,
  `freephone` varchar(255) DEFAULT NULL,
  `fax` varchar(255) DEFAULT NULL,
  `email` varchar(255) DEFAULT NULL,
  `website_url` varchar(255) DEFAULT NULL,
  `business_hours_start` time DEFAULT NULL,
  `business_hours_end` time DEFAULT NULL,
  `closed_day_monday` tinyint(1) DEFAULT NULL,
  `closed_day_tuesday` tinyint(1) DEFAULT NULL,
  `closed_day_wednesday` tinyint(1) DEFAULT NULL,
  `closed_day_thursday` tinyint(1) DEFAULT NULL,
  `closed_day_friday` tinyint(1) DEFAULT NULL,
  `closed_day_saturday` tinyint(1) DEFAULT NULL,
  `closed_day_sunday` tinyint(1) DEFAULT NULL,
  `bank_account_type` varchar(50) DEFAULT NULL,
  `bank_name` varchar(255) DEFAULT NULL,
  `bank_branch_name` varchar(255) DEFAULT NULL,
  `bank_account_name` varchar(255) DEFAULT NULL,
  `bank_account_name_kana` varchar(255) DEFAULT NULL,
  `bank_code` int(11) DEFAULT NULL,
  `bank_branch_code` int(11) DEFAULT NULL,
  `bank_account_number` int(11) DEFAULT NULL,
  `health_center_registerd_location` varchar(50) DEFAULT NULL,
  `license_hari_number` int(11) DEFAULT NULL,
  `license_hari_issued_date` date DEFAULT NULL,
  `license_kyu_number` int(11) DEFAULT NULL,
  `license_kyu_issued_date` date DEFAULT NULL,
  `license_massage_number` int(11) DEFAULT NULL,
  `license_massage_issued_date` date DEFAULT NULL,
  `billing_prefecture` varchar(255) DEFAULT NULL,
  `therapist_number` int(11) DEFAULT NULL,
  `medical_institution_number` int(11) DEFAULT NULL,
  `should_round_amount` tinyint(1) DEFAULT NULL,
  `document_formats` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `clinic_info_prefectures_FK` (`billing_prefecture`),
  KEY `clinic_info_document_formats_FK` (`document_formats`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='自社情報';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `clinic_info`
--

LOCK TABLES `clinic_info` WRITE;
/*!40000 ALTER TABLE `clinic_info` DISABLE KEYS */;
INSERT INTO `clinic_info` VALUES (1,'2025-11-17 10:41:44','2026-01-20 10:56:55','宮崎中央鍼灸マッサージ','草薙','素子','2025-10-01','880-0002','宮崎県','宮崎市中央通','中央ビル 205','2520502050','02020502050','012020502050','2520502050','japan@gmail.com','https://japan.com','06:00:00','20:00:00',0,1,0,0,0,0,0,'普通','日本銀行','宮崎支店','草薙素子','クサナギモトコ',2500,250,2502500,'施術所所在地',250250,'2025-10-01',250250,'2025-10-01',250250,'2025-10-01','宮崎県',410248,250250,1,'標準2013');
/*!40000 ALTER TABLE `clinic_info` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `clinic_users`
--

DROP TABLE IF EXISTS `clinic_users`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `clinic_users` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `created_at` datetime NOT NULL DEFAULT current_timestamp(),
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `last_name` varchar(255) NOT NULL,
  `first_name` varchar(255) NOT NULL,
  `last_kana` varchar(255) NOT NULL,
  `first_kana` varchar(255) NOT NULL,
  `birthday` date DEFAULT NULL,
  `age` int(11) NOT NULL,
  `gender_id` int(11) DEFAULT NULL,
  `postal_code` varchar(255) NOT NULL,
  `address_1` varchar(255) NOT NULL,
  `address_2` varchar(255) NOT NULL,
  `address_3` varchar(255) NOT NULL,
  `phone` varchar(255) DEFAULT NULL,
  `cell_phone` varchar(255) DEFAULT NULL,
  `fax` varchar(255) DEFAULT NULL,
  `email` varchar(255) DEFAULT NULL,
  `housecall_distance` int(11) DEFAULT NULL,
  `housecall_additional_distance` int(11) DEFAULT NULL,
  `is_redeemed` tinyint(1) DEFAULT NULL,
  `application_count` int(11) DEFAULT NULL,
  `note` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `clinic_users_gender_FK` (`gender_id`),
  CONSTRAINT `clinic_users_gender_FK` FOREIGN KEY (`gender_id`) REFERENCES `gender` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=307 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='利用者';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `clinic_users`
--

LOCK TABLES `clinic_users` WRITE;
/*!40000 ALTER TABLE `clinic_users` DISABLE KEYS */;
INSERT INTO `clinic_users` VALUES (157,'2025-11-22 12:57:58','2025-12-16 14:56:50','山口','浩二','ヤマグチ','コウジ','1989-02-24',36,1,'150-0001','東京都','渋谷区','神宮前2-23-6','07-9186-5351','074-5448-2568','08-5405-7417','yama@gmail.com',8,NULL,1,8,'ストレスによる全身の緊張が強い。'),(158,'2025-11-22 12:57:58','2025-11-22 12:57:58','遠藤','哲也','エンドウ','テツヤ','1982-11-14',43,1,'530-0001','大阪府','大阪市北区','天神橋1-30-13','05-8137-4178','082-4048-4520','03-1971-2546','user2@example.com',NULL,NULL,0,42,'定期的な施術を希望されている。腰痛の改善が見られる。'),(159,'2025-11-22 12:57:58','2025-11-22 13:05:34','太田','剛','オオタ','ツヨシ','1981-07-05',44,1,'730-0001','広島県','広島市中区','幟町7-21-15','08-1555-7387','078-9976-3149',NULL,'user3@example.com',20,18,0,47,'運動後の筋肉痛のケアで来院。スポーツ選手。'),(160,'2025-11-22 12:57:58','2025-11-22 12:57:58','石川','紗奈','イシカワ','サナ','1972-03-18',53,2,'150-0001','東京都','渋谷区','原宿3-30-9','04-9746-4026','087-7614-6655',NULL,NULL,NULL,NULL,0,36,'睡眠の質が悪いとのこと。リラクゼーション重視。'),(161,'2025-11-22 12:57:58','2025-11-22 12:57:58','清水','心春','シミズ','コハル','1980-11-25',44,2,'220-0001','神奈川県','横浜市西区','北幸9-14-3','05-6309-9687','071-5152-7749','07-6325-9674',NULL,NULL,NULL,0,41,'高齢のため、優しい施術を心がける。'),(162,'2025-11-22 12:57:58','2025-11-22 12:57:58','橋本','拓也','ハシモト','タクヤ','1972-08-12',53,1,'650-0001','兵庫県','神戸市中央区','港島1-22-13','07-7026-6675','085-6753-8993',NULL,'user6@example.com',NULL,NULL,0,46,'長時間の立ち仕事による足のむくみが気になる。'),(163,'2025-11-22 12:57:58','2025-11-22 13:05:34','福田','琴音','フクダ','コトネ','1986-09-15',39,2,'160-0001','東京都','新宿区','西新宿2-12-20','05-7036-3584','075-4476-4751',NULL,'user7@example.com',4,2,0,27,'膝の痛みで来院。歩行時の違和感が軽減してきた。'),(164,'2025-11-22 12:57:58','2025-11-22 12:57:58','佐藤','優太','サトウ','ユウタ','1945-05-18',80,1,'460-0001','愛知県','名古屋市中区','錦3-27-12','07-1147-3885','090-9936-1706',NULL,NULL,4,2,0,32,'スポーツ外傷後のケア。競技復帰を目指している。'),(165,'2025-11-22 12:57:58','2025-11-22 13:05:34','松本','陽子','マツモト','ヨウコ','2003-01-24',22,2,'812-0001','福岡県','福岡市博多区','住吉8-16-5','06-3174-9024','073-4108-7413','08-9244-9879','user9@example.com',18,16,0,30,'冷え性がひどく、全身のマッサージを希望。'),(166,'2025-11-22 12:57:58','2025-11-22 13:05:34','中島','裕二','ナカジマ','ユウジ','2005-09-11',20,1,'980-0001','宮城県','仙台市青葉区','花京院6-22-11','09-3949-5196','075-9604-4557',NULL,'user10@example.com',18,16,0,35,NULL),(167,'2025-11-22 12:57:58','2025-11-22 12:57:58','加藤','美月','カトウ','ミヅキ','1943-01-24',82,2,'160-0001','東京都','新宿区','歌舞伎町6-4-12','03-3942-3732','082-2000-9201','05-4841-8156','user11@example.com',NULL,NULL,1,37,NULL),(168,'2025-11-22 12:57:58','2025-11-22 13:05:34','長谷川','哲也','ハセガワ','テツヤ','1988-03-12',37,1,'220-0001','神奈川県','横浜市西区','南幸8-11-4','07-5394-4833','073-7603-3187',NULL,'user12@example.com',10,8,0,27,'在宅勤務が増え、肩や背中のこりが悪化。'),(169,'2025-11-22 12:57:58','2025-11-22 13:05:34','福田','勇気','フクダ','ユウキ','1949-09-10',76,1,'100-0001','東京都','千代田区','霞が関3-6-12','04-8114-1899','072-3982-8008','06-3353-7905','user13@example.com',4,2,0,50,'高齢のため、優しい施術を心がける。'),(170,'2025-11-22 12:57:58','2025-11-22 12:57:58','山口','健一','ヤマグチ','ケンイチ','1964-11-14',61,1,'160-0001','東京都','新宿区','高田馬場7-16-2','09-9559-5543','090-5361-4100',NULL,'user14@example.com',NULL,NULL,0,44,'高齢のため、優しい施術を心がける。'),(171,'2025-11-22 12:57:58','2025-11-22 12:57:58','藤田','雄一','フジタ','ユウイチ','1941-12-26',83,1,'980-0001','宮城県','仙台市青葉区','国分町1-8-3','09-4779-5732','075-2191-7140','08-2677-5227','user15@example.com',NULL,NULL,0,10,'スポーツ外傷後のケア。競技復帰を目指している。'),(172,'2025-11-22 12:57:58','2025-11-22 12:57:58','木村','隆','キムラ','タカシ','1974-10-09',51,1,'530-0001','大阪府','大阪市北区','梅田6-9-10','09-8808-3377','073-7517-9878',NULL,'user16@example.com',NULL,NULL,0,10,'腰椎ヘルニアの既往歴あり。慎重な施術が必要。'),(173,'2025-11-22 12:57:58','2025-11-22 13:05:34','森','舞','モリ','マイ','1967-12-31',57,2,'980-0001','宮城県','仙台市青葉区','花京院7-15-2','05-9929-5439','071-4273-3532',NULL,'user17@example.com',11,9,0,29,'頭痛持ちで薬に頼りたくないとのこと。'),(174,'2025-11-22 12:57:58','2025-11-22 13:05:34','小野','和子','オノ','カズコ','1996-01-04',29,2,'542-0001','大阪府','大阪市中央区','本町9-12-9','09-5480-4163','086-4984-9338',NULL,'user18@example.com',9,7,0,26,'高齢のため、優しい施術を心がける。'),(175,'2025-11-22 12:57:58','2025-11-22 12:57:58','清水','裕二','シミズ','ユウジ','1951-05-25',74,1,'530-0001','大阪府','大阪市北区','堂島8-9-20','06-5126-1718','071-5970-2592',NULL,NULL,NULL,NULL,1,2,'足のしびれがあり、整形外科と併用中。'),(176,'2025-11-22 12:57:58','2025-11-22 13:05:34','原田','琴音','ハラダ','コトネ','1948-06-08',77,2,'980-0001','宮城県','仙台市青葉区','中央1-23-8','07-9057-7019','077-6505-5107',NULL,'user20@example.com',6,4,0,11,'腰椎ヘルニアの既往歴あり。慎重な施術が必要。'),(177,'2025-11-22 12:57:58','2025-11-22 12:57:58','山下','大翔','ヤマシタ','ヒロト','1958-05-29',67,1,'530-0001','大阪府','大阪市北区','堂島7-21-14','09-3298-1858','082-4700-8524','07-2440-9848','user21@example.com',NULL,NULL,0,4,'ストレスによる全身の緊張が強い。'),(178,'2025-11-22 12:57:58','2025-11-22 13:05:34','渡辺','雄一','ワタナベ','ユウイチ','1976-09-09',49,1,'460-0001','愛知県','名古屋市中区','金山3-28-15','09-2420-8652','077-5623-2606',NULL,NULL,7,5,0,16,'肩こりがひどく、週2回の施術を継続中。'),(179,'2025-11-22 12:57:58','2025-11-22 12:57:58','佐藤','颯太','サトウ','ソウタ','1967-09-03',58,1,'160-0001','東京都','新宿区','新宿8-8-5','09-3663-7834','090-1789-6555',NULL,'user23@example.com',NULL,NULL,0,32,'慢性的な肩こりで来院。姿勢改善のアドバイス済み。'),(180,'2025-11-22 12:57:58','2025-11-22 13:05:34','中島','大介','ナカジマ','ダイスケ','1945-12-14',79,1,'100-0001','東京都','千代田区','丸の内2-15-8','06-2995-2605','074-5049-2355',NULL,'user24@example.com',16,14,0,24,'腰椎ヘルニアの既往歴あり。慎重な施術が必要。'),(181,'2025-11-22 12:57:58','2025-11-22 12:57:58','岡本','美優','オカモト','ミユ','1960-08-04',65,2,'600-0001','京都府','京都市下京区','東山1-26-6','04-6496-9973','089-1359-1260',NULL,'user25@example.com',NULL,NULL,0,18,NULL),(182,'2025-11-22 12:57:58','2025-11-22 12:57:58','原田','孝之','ハラダ','タカユキ','1951-08-09',74,1,'812-0001','福岡県','福岡市博多区','中洲7-21-14','06-5224-9519','071-6381-6197',NULL,NULL,NULL,NULL,0,47,'定期健診で姿勢の悪さを指摘され来院。'),(183,'2025-11-22 12:57:58','2025-11-22 12:57:58','太田','秀樹','オオタ','ヒデキ','1988-12-31',36,1,'542-0001','大阪府','大阪市中央区','道頓堀2-7-6','09-6895-2783','072-5982-2903','07-1599-7120',NULL,NULL,NULL,0,5,'膝の痛みで来院。歩行時の違和感が軽減してきた。'),(184,'2025-11-22 12:57:58','2025-11-22 12:57:58','小林','誠','コバヤシ','マコト','1954-04-08',71,1,'160-0001','東京都','新宿区','歌舞伎町2-30-20','03-3029-1467','071-4845-4941','06-3222-8806',NULL,NULL,NULL,1,11,'頭痛持ちで薬に頼りたくないとのこと。'),(185,'2025-11-22 12:57:58','2025-11-22 12:57:58','中村','拓也','ナカムラ','タクヤ','1985-03-10',40,1,'160-0001','東京都','新宿区','高田馬場2-6-9','09-8113-6751','089-7462-6650',NULL,'user29@example.com',NULL,NULL,0,49,'頭痛持ちで薬に頼りたくないとのこと。'),(186,'2025-11-22 12:57:58','2025-11-22 12:57:58','佐藤','結衣','サトウ','ユイ','1941-05-03',84,2,'530-0001','大阪府','大阪市北区','堂島4-19-13','03-1559-4928','071-8989-5669','08-2437-6183','user30@example.com',NULL,NULL,0,21,NULL),(187,'2025-11-22 12:57:58','2025-11-22 12:57:58','田中','結衣','タナカ','ユイ','1948-02-09',77,2,'730-0001','広島県','広島市中区','幟町2-11-8','09-2470-6350','075-1762-6302','03-7354-8183','user31@example.com',NULL,NULL,0,21,'膝の痛みで来院。歩行時の違和感が軽減してきた。'),(188,'2025-11-22 12:57:58','2025-11-22 13:05:34','佐々木','大介','ササキ','ダイスケ','1981-04-19',44,1,'060-0001','北海道','札幌市中央区','狸小路8-1-1','03-9449-7963','081-5119-6239',NULL,'user32@example.com',19,17,0,0,NULL),(189,'2025-11-22 12:57:58','2025-11-22 12:57:58','吉田','桜','ヨシダ','サクラ','1995-10-29',30,2,'160-0001','東京都','新宿区','四谷7-17-20','06-9429-8739','078-4076-8495',NULL,'user33@example.com',NULL,NULL,0,13,'運動後の筋肉痛のケアで来院。スポーツ選手。'),(190,'2025-11-22 12:57:58','2025-11-22 12:57:58','田中','遥','タナカ','ハルカ','1963-07-09',62,2,'060-0001','北海道','札幌市中央区','宮の森9-27-12','09-3627-2016','073-6098-4786',NULL,'user34@example.com',NULL,NULL,0,9,'定期的な施術を希望されている。腰痛の改善が見られる。'),(191,'2025-11-22 12:57:58','2025-11-22 13:05:34','松本','大介','マツモト','ダイスケ','1961-06-24',64,1,'542-0001','大阪府','大阪市中央区','心斎橋4-17-1','08-2978-3849','075-1873-2100',NULL,'user35@example.com',16,14,0,47,'定期的な施術を希望されている。腰痛の改善が見られる。'),(192,'2025-11-22 12:57:58','2025-11-22 12:57:58','石井','直樹','イシイ','ナオキ','1960-10-31',65,1,'460-0001','愛知県','名古屋市中区','錦1-25-17','06-2753-2670','088-6162-1612',NULL,NULL,NULL,NULL,0,5,'慢性的な肩こりで来院。姿勢改善のアドバイス済み。'),(193,'2025-11-22 12:57:58','2025-11-22 12:57:58','清水','萌','シミズ','モエ','1983-02-28',42,2,'600-0001','京都府','京都市下京区','四条2-9-8','03-3752-2040','078-3878-4936',NULL,'user37@example.com',NULL,NULL,0,19,'首のこりと頭痛の症状あり。デスクワークが多い。'),(194,'2025-11-22 12:57:58','2025-11-22 12:57:58','加藤','秀樹','カトウ','ヒデキ','1955-04-27',70,1,'650-0001','兵庫県','神戸市中央区','元町4-26-6','04-6253-6602','086-9744-4761','09-7425-1008',NULL,NULL,NULL,0,13,NULL),(195,'2025-11-22 12:57:58','2025-11-22 12:57:58','林','一郎','ハヤシ','イチロウ','2005-03-07',20,1,'530-0001','大阪府','大阪市北区','堂島3-16-13','09-4466-1166','085-4336-3871','04-1706-4746',NULL,NULL,NULL,1,47,'冷え性がひどく、全身のマッサージを希望。'),(196,'2025-11-22 12:57:58','2025-11-22 13:05:34','高橋','和也','タカハシ','カズヤ','1969-08-10',56,1,'330-0001','埼玉県','さいたま市大宮区','仲町4-22-12','07-7797-1040','087-7583-2847',NULL,NULL,3,1,0,46,'冷え性がひどく、全身のマッサージを希望。'),(197,'2025-11-22 12:57:58','2025-11-22 12:57:58','山下','陽子','ヤマシタ','ヨウコ','1989-06-30',36,2,'650-0001','兵庫県','神戸市中央区','港島6-4-8','06-8169-6697','076-6159-8070',NULL,'user41@example.com',NULL,NULL,0,14,'首のこりと頭痛の症状あり。デスクワークが多い。'),(198,'2025-11-22 12:57:58','2025-11-22 12:57:58','小川','太郎','オガワ','タロウ','1973-09-18',52,1,'220-0001','神奈川県','横浜市西区','平沼2-6-10','09-6172-8702','081-1056-6529',NULL,NULL,NULL,NULL,1,37,'腰椎ヘルニアの既往歴あり。慎重な施術が必要。'),(199,'2025-11-22 12:57:58','2025-11-22 13:05:34','石井','裕子','イシイ','ユウコ','1967-08-30',58,2,'530-0001','大阪府','大阪市北区','西天満1-15-2','04-6606-1817','086-1843-6582',NULL,'user43@example.com',6,4,0,28,'頭痛持ちで薬に頼りたくないとのこと。'),(200,'2025-11-22 12:57:58','2025-11-22 12:57:58','佐藤','明美','サトウ','アケミ','1981-12-17',43,2,'530-0001','大阪府','大阪市北区','中之島7-12-11','04-1797-2364','073-1984-8675',NULL,NULL,NULL,NULL,0,4,'定期健診で姿勢の悪さを指摘され来院。'),(201,'2025-11-22 12:57:58','2025-11-22 12:57:58','太田','孝之','オオタ','タカユキ','1955-02-26',70,1,'980-0001','宮城県','仙台市青葉区','花京院2-25-6','08-7974-7484','072-7746-5812',NULL,'user45@example.com',NULL,NULL,0,0,'定期健診で姿勢の悪さを指摘され来院。'),(202,'2025-11-22 12:57:58','2025-11-22 12:57:58','後藤','哲也','ゴトウ','テツヤ','1978-10-11',47,1,'542-0001','大阪府','大阪市中央区','船場8-29-17','04-8449-4446','084-3022-5025',NULL,NULL,NULL,NULL,0,17,'足のしびれがあり、整形外科と併用中。'),(203,'2025-11-22 12:57:58','2025-11-22 12:57:58','藤田','舞','フジタ','マイ','1985-08-15',40,2,'060-0001','北海道','札幌市中央区','宮の森8-3-16','03-2865-4824','089-3355-6840',NULL,'user47@example.com',NULL,NULL,0,1,'長時間の立ち仕事による足のむくみが気になる。'),(204,'2025-11-22 12:57:58','2025-11-22 12:57:58','山下','隆','ヤマシタ','タカシ','1978-01-21',47,1,'260-0001','千葉県','千葉市中央区','栄町8-19-4','04-6272-6338','086-2850-5450',NULL,'user48@example.com',NULL,NULL,0,42,'在宅勤務が増え、肩や背中のこりが悪化。'),(205,'2025-11-22 12:57:58','2025-11-22 12:57:58','原田','勇気','ハラダ','ユウキ','1962-11-05',63,1,'220-0001','神奈川県','横浜市西区','北幸1-11-16','08-3365-4570','077-6081-9229',NULL,'user49@example.com',NULL,NULL,1,8,'妊娠中のため、体位に配慮した施術が必要。'),(206,'2025-11-22 12:57:58','2025-11-22 12:57:58','鈴木','和子','スズキ','カズコ','1973-04-13',52,2,'980-0001','宮城県','仙台市青葉区','国分町5-27-17','04-3376-9162','080-7505-3197',NULL,'user50@example.com',NULL,NULL,0,21,'定期健診で姿勢の悪さを指摘され来院。'),(207,'2025-11-22 12:57:58','2025-11-22 13:05:34','竹田','由美','タケダ','ユミ','1980-01-19',45,2,'150-0001','東京都','渋谷区','渋谷1-11-7','03-8758-4890','082-3454-4311','05-9049-6157','user51@example.com',17,15,0,1,NULL),(208,'2025-11-22 12:57:58','2025-11-22 12:57:58','太田','一郎','オオタ','イチロウ','1971-08-05',54,1,'160-0001','東京都','新宿区','四谷8-20-1','04-8108-1305','087-3443-4070','09-1700-5311',NULL,NULL,NULL,0,43,'足のしびれがあり、整形外科と併用中。'),(209,'2025-11-22 12:57:58','2025-11-22 13:05:34','井上','美月','イノウエ','ミヅキ','1959-04-02',66,2,'460-0001','愛知県','名古屋市中区','錦3-23-10','09-3628-1878','083-6858-1326',NULL,'user53@example.com',16,14,0,48,'在宅勤務が増え、肩や背中のこりが悪化。'),(210,'2025-11-22 12:57:58','2025-11-22 13:05:34','清水','大介','シミズ','ダイスケ','1969-11-30',55,1,'730-0001','広島県','広島市中区','紙屋町8-11-12','08-6702-7728','080-6675-4731',NULL,NULL,17,15,0,30,'長時間の立ち仕事による足のむくみが気になる。'),(211,'2025-11-22 12:57:58','2025-11-22 12:57:58','田中','結衣','タナカ','ユイ','1958-11-08',67,2,'160-0001','東京都','新宿区','新宿1-18-2','07-9791-2984','077-2328-6384','08-5949-2129',NULL,NULL,NULL,0,6,'スポーツ外傷後のケア。競技復帰を目指している。'),(212,'2025-11-22 12:57:58','2025-11-22 12:57:58','中野','裕二','ナカノ','ユウジ','1942-04-22',83,1,'730-0001','広島県','広島市中区','大手町2-13-6','04-4451-7844','078-9667-6874',NULL,'user56@example.com',NULL,NULL,0,10,NULL),(213,'2025-11-22 12:57:58','2025-11-22 12:57:58','阿部','一郎','アベ','イチロウ','1953-07-24',72,1,'650-0001','兵庫県','神戸市中央区','旧居留地4-13-11','07-4080-6750','071-1992-8341',NULL,NULL,NULL,NULL,0,21,NULL),(214,'2025-11-22 12:57:58','2025-11-22 13:05:34','青木','花子','アオキ','ハナコ','2003-01-26',22,2,'542-0001','大阪府','大阪市中央区','道頓堀1-23-1','07-8072-9477','081-8200-8363',NULL,'user58@example.com',10,8,0,34,'慢性的な肩こりで来院。姿勢改善のアドバイス済み。'),(215,'2025-11-22 12:57:58','2025-11-22 12:57:58','阿部','雄一','アベ','ユウイチ','1980-08-19',45,1,'150-0001','東京都','渋谷区','代官山5-1-16','05-9842-1723','083-4770-5081',NULL,'user59@example.com',NULL,NULL,1,36,'睡眠の質が悪いとのこと。リラクゼーション重視。'),(216,'2025-11-22 12:57:58','2025-11-22 13:05:34','吉田','雄一','ヨシダ','ユウイチ','1969-07-13',56,1,'730-0001','広島県','広島市中区','大手町6-13-5','03-9310-2368','084-6738-5140',NULL,'user60@example.com',18,16,1,48,'交通事故後のリハビリ目的。保険適用。'),(217,'2025-11-22 12:57:58','2025-11-22 12:57:58','原田','剛','ハラダ','ツヨシ','1968-02-23',57,1,'650-0001','兵庫県','神戸市中央区','元町4-16-17','03-3002-4809','081-5270-5293',NULL,'user61@example.com',NULL,NULL,1,0,'在宅勤務が増え、肩や背中のこりが悪化。'),(218,'2025-11-22 12:57:58','2025-11-22 12:57:58','中島','彩','ナカジマ','アヤ','1960-12-13',64,2,'060-0001','北海道','札幌市中央区','すすきの5-30-14','03-4189-4517','080-4944-2757',NULL,'user62@example.com',NULL,NULL,0,10,'高齢のため、優しい施術を心がける。'),(219,'2025-11-22 12:57:58','2025-11-22 12:57:58','村上','誠','ムラカミ','マコト','1972-02-08',53,1,'812-0001','福岡県','福岡市博多区','中洲9-30-3','04-8314-3020','077-7855-8413',NULL,'user63@example.com',NULL,NULL,1,16,'スポーツ外傷後のケア。競技復帰を目指している。'),(220,'2025-11-22 12:57:58','2025-11-22 12:57:58','藤田','大翔','フジタ','ヒロト','1994-03-23',31,1,'460-0001','愛知県','名古屋市中区','錦6-30-12','08-3530-8447','070-4623-1424',NULL,'user64@example.com',NULL,NULL,0,0,'睡眠の質が悪いとのこと。リラクゼーション重視。'),(221,'2025-11-22 12:57:58','2025-11-22 12:57:58','山下','拓也','ヤマシタ','タクヤ','1949-04-04',76,1,'460-0001','愛知県','名古屋市中区','大須2-23-10','05-2314-3475','087-6244-8882','05-1008-3849',NULL,NULL,NULL,1,4,'足のしびれがあり、整形外科と併用中。'),(222,'2025-11-22 12:57:58','2025-11-22 13:05:34','遠藤','由美','エンドウ','ユミ','1970-06-06',55,2,'060-0001','北海道','札幌市中央区','宮の森9-26-19','09-3683-6388','078-8576-7217',NULL,NULL,9,7,1,31,'膝の痛みで来院。歩行時の違和感が軽減してきた。'),(223,'2025-11-22 12:57:58','2025-11-22 12:57:58','吉田','恵子','ヨシダ','ケイコ','1978-08-20',47,2,'160-0001','東京都','新宿区','新宿3-13-9','03-2099-7026','086-7176-3535',NULL,'user67@example.com',NULL,NULL,0,22,'交通事故後のリハビリ目的。保険適用。'),(224,'2025-11-22 12:57:58','2025-11-22 12:57:58','岡田','隆','オカダ','タカシ','1987-06-01',38,1,'812-0001','福岡県','福岡市博多区','中洲2-27-2','06-1018-3999','075-5991-9450',NULL,'user68@example.com',NULL,NULL,0,36,'頭痛持ちで薬に頼りたくないとのこと。'),(225,'2025-11-22 12:57:58','2025-11-22 12:57:58','吉田','葵','ヨシダ','アオイ','1953-12-31',71,2,'650-0001','兵庫県','神戸市中央区','旧居留地7-22-16','09-3539-2474','081-7202-9227',NULL,'user69@example.com',NULL,NULL,0,48,'長時間の立ち仕事による足のむくみが気になる。'),(226,'2025-11-22 12:57:58','2025-11-22 12:57:58','遠藤','裕二','エンドウ','ユウジ','1967-06-01',58,1,'220-0001','神奈川県','横浜市西区','南幸7-19-13','07-2452-6044','089-1325-6097',NULL,'user70@example.com',NULL,NULL,0,38,'産後の骨盤矯正を希望。育児中のため時間調整必要。'),(227,'2025-11-22 12:57:58','2025-11-22 13:05:34','林','陽太','ハヤシ','ヨウタ','2001-07-30',24,1,'812-0001','福岡県','福岡市博多区','住吉6-25-18','04-7466-4863','081-7603-1212',NULL,'user71@example.com',3,1,1,39,'長時間の立ち仕事による足のむくみが気になる。'),(228,'2025-11-22 12:57:58','2025-11-22 12:57:58','村上','陽子','ムラカミ','ヨウコ','2004-12-30',20,2,'460-0001','愛知県','名古屋市中区','栄1-2-15','06-2190-4090','087-5817-6671','05-9148-3835','user72@example.com',NULL,NULL,1,6,'定期的な施術を希望されている。腰痛の改善が見られる。'),(229,'2025-11-22 12:57:58','2025-11-22 13:05:34','近藤','琴音','コンドウ','コトネ','2002-02-15',23,2,'530-0001','大阪府','大阪市北区','中之島1-10-1','08-8489-9141','084-9745-1457','03-4692-4683','user73@example.com',8,6,0,4,NULL),(230,'2025-11-22 12:57:58','2025-11-22 13:05:34','山口','美咲','ヤマグチ','ミサキ','1971-04-09',54,2,'980-0001','宮城県','仙台市青葉区','本町9-15-11','04-6857-7781','073-7356-2018',NULL,'user74@example.com',20,18,0,40,'睡眠の質が悪いとのこと。リラクゼーション重視。'),(231,'2025-11-22 12:57:58','2025-11-22 12:57:58','金子','真由美','カネコ','マユミ','1962-03-06',63,2,'600-0001','京都府','京都市下京区','祇園5-7-18','05-5867-4262','076-8303-6961','04-1459-2404',NULL,NULL,NULL,0,14,'足のしびれがあり、整形外科と併用中。'),(232,'2025-11-22 12:57:58','2025-11-22 12:57:58','中村','誠','ナカムラ','マコト','1981-12-30',43,1,'542-0001','大阪府','大阪市中央区','本町7-27-11','03-5036-6648','089-8438-9420',NULL,'user76@example.com',NULL,NULL,0,46,NULL),(233,'2025-11-22 12:57:58','2025-11-22 13:05:34','清水','勇気','シミズ','ユウキ','1992-11-08',33,1,'530-0001','大阪府','大阪市北区','西天満9-13-13','07-9044-2409','089-6420-5815',NULL,'user77@example.com',19,17,1,29,'定期健診で姿勢の悪さを指摘され来院。'),(234,'2025-11-22 12:57:58','2025-11-22 12:57:58','山口','花子','ヤマグチ','ハナコ','1969-07-19',56,2,'160-0001','東京都','新宿区','新宿9-7-11','03-5846-7022','077-9182-8235','09-3843-8460','user78@example.com',NULL,NULL,0,16,'産後の骨盤矯正を希望。育児中のため時間調整必要。'),(235,'2025-11-22 12:57:58','2025-11-22 12:57:58','長谷川','陽菜','ハセガワ','ヒナ','1964-01-12',61,2,'530-0001','大阪府','大阪市北区','西天満3-2-1','08-5866-6479','089-7301-6162','07-3808-8143','user79@example.com',NULL,NULL,0,49,'運動後の筋肉痛のケアで来院。スポーツ選手。'),(236,'2025-11-22 12:57:58','2025-11-22 13:05:34','山本','剛','ヤマモト','ツヨシ','1994-07-17',31,1,'060-0001','北海道','札幌市中央区','狸小路9-6-10','04-5779-3961','088-1322-3722',NULL,'user80@example.com',20,18,1,43,NULL),(238,'2025-11-22 12:57:58','2025-11-22 12:57:58','藤井','桜','フジイ','サクラ','1965-04-26',60,2,'812-0001','福岡県','福岡市博多区','祇園6-9-8','08-1182-9945','084-7749-5245',NULL,'user82@example.com',NULL,NULL,0,17,'睡眠の質が悪いとのこと。リラクゼーション重視。'),(239,'2025-11-22 12:57:58','2025-11-22 12:57:58','清水','修','シミズ','オサム','1992-01-04',33,1,'330-0001','埼玉県','さいたま市大宮区','下町4-21-11','07-6670-3882','082-2322-2163','05-1749-6555','user83@example.com',NULL,NULL,0,32,'高齢のため、優しい施術を心がける。'),(240,'2025-11-22 12:57:58','2025-11-22 12:57:58','金子','秀樹','カネコ','ヒデキ','1995-07-27',30,1,'330-0001','埼玉県','さいたま市大宮区','大宮5-8-5','03-5624-8978','072-2422-5670','05-1570-9270','user84@example.com',NULL,NULL,0,5,'慢性的な肩こりで来院。姿勢改善のアドバイス済み。'),(241,'2025-11-22 12:57:58','2025-11-22 12:57:58','池田','美穂','イケダ','ミホ','1970-12-11',54,2,'100-0001','東京都','千代田区','大手町5-6-9','09-7273-2690','089-5834-7353',NULL,NULL,NULL,NULL,0,40,'頭痛持ちで薬に頼りたくないとのこと。'),(242,'2025-11-22 12:57:58','2025-11-22 13:05:34','井上','楓','イノウエ','カエデ','1969-11-11',56,2,'150-0001','東京都','渋谷区','原宿2-23-6','06-8071-9793','084-5285-5666',NULL,'user86@example.com',9,7,1,19,'妊娠中のため、体位に配慮した施術が必要。'),(243,'2025-11-22 12:57:58','2025-11-22 12:57:58','山下','舞','ヤマシタ','マイ','1975-01-09',50,2,'460-0001','愛知県','名古屋市中区','金山6-27-7','08-3680-9481','075-9215-3737','06-8533-5900',NULL,NULL,NULL,1,41,'高齢のため、優しい施術を心がける。'),(244,'2025-11-22 12:57:58','2025-11-22 12:57:58','原田','凛','ハラダ','リン','1964-10-07',61,2,'530-0001','大阪府','大阪市北区','天神橋1-8-18','09-1218-8637','078-5817-6545',NULL,NULL,NULL,NULL,0,49,NULL),(245,'2025-11-22 12:57:58','2025-11-22 12:57:58','山口','浩','ヤマグチ','ヒロシ','1978-08-08',47,1,'650-0001','兵庫県','神戸市中央区','港島6-5-17','08-7839-2432','076-8453-6408','09-7912-4654','user89@example.com',NULL,NULL,1,37,'運動後の筋肉痛のケアで来院。スポーツ選手。'),(246,'2025-11-22 12:57:58','2025-11-22 12:57:58','石川','秀樹','イシカワ','ヒデキ','1971-03-24',54,1,'812-0001','福岡県','福岡市博多区','祇園9-17-20','03-1160-2074','071-8065-7278',NULL,'user90@example.com',NULL,NULL,0,2,'定期健診で姿勢の悪さを指摘され来院。'),(247,'2025-11-22 12:57:58','2025-11-22 12:57:58','小林','悠真','コバヤシ','ユウマ','1972-09-01',53,1,'100-0001','東京都','千代田区','霞が関4-20-2','04-6339-5077','075-7236-8289',NULL,'user91@example.com',NULL,NULL,0,41,'在宅勤務が増え、肩や背中のこりが悪化。'),(248,'2025-11-22 12:57:58','2025-11-22 12:57:58','遠藤','裕二','エンドウ','ユウジ','1958-06-17',67,1,'812-0001','福岡県','福岡市博多区','住吉1-4-7','07-4785-1111','082-7628-6844','06-5666-6050','user92@example.com',NULL,NULL,1,3,'冷え性がひどく、全身のマッサージを希望。'),(249,'2025-11-22 12:57:58','2025-11-22 13:05:34','小川','隆','オガワ','タカシ','1988-10-07',37,1,'730-0001','広島県','広島市中区','八丁堀4-26-6','09-5868-6158','085-5675-1839',NULL,'user93@example.com',13,11,0,10,'長時間の立ち仕事による足のむくみが気になる。'),(250,'2025-11-22 12:57:58','2025-11-22 13:05:34','坂本','隆','サカモト','タカシ','1987-07-26',38,1,'100-0001','東京都','千代田区','霞が関9-12-5','03-3605-9203','089-6915-1860','09-6864-7785',NULL,8,6,0,46,'腰椎ヘルニアの既往歴あり。慎重な施術が必要。'),(251,'2025-11-22 12:57:58','2025-11-22 12:57:58','岡本','彩','オカモト','アヤ','1975-01-16',50,2,'980-0001','宮城県','仙台市青葉区','中央1-13-11','09-5145-4097','073-4328-6154',NULL,'user95@example.com',NULL,NULL,1,40,'運動後の筋肉痛のケアで来院。スポーツ選手。'),(252,'2025-11-22 12:57:58','2025-11-22 12:57:58','山口','優太','ヤマグチ','ユウタ','1998-10-15',27,1,'600-0001','京都府','京都市下京区','祇園8-17-8','03-7134-2326','075-4781-5256',NULL,'user96@example.com',NULL,NULL,0,10,'スポーツ外傷後のケア。競技復帰を目指している。'),(253,'2025-11-22 12:57:58','2025-11-22 12:57:58','村上','大翔','ムラカミ','ヒロト','2004-11-29',20,1,'150-0001','東京都','渋谷区','神宮前4-22-8','03-4395-1582','075-8733-2727',NULL,'user97@example.com',NULL,NULL,0,34,'ストレスによる全身の緊張が強い。'),(254,'2025-11-22 12:57:58','2025-11-22 12:57:58','加藤','蓮','カトウ','レン','1959-11-03',66,1,'542-0001','大阪府','大阪市中央区','難波5-11-20','06-6533-9980','076-3825-8646',NULL,'user98@example.com',NULL,NULL,1,6,'長時間の立ち仕事による足のむくみが気になる。'),(255,'2025-11-22 12:57:58','2025-11-22 13:05:34','竹田','舞','タケダ','マイ','1993-01-09',32,2,'260-0001','千葉県','千葉市中央区','富士見2-17-4','04-5163-4701','085-3357-6743',NULL,'user99@example.com',9,7,0,11,'高齢のため、優しい施術を心がける。'),(256,'2025-11-22 12:57:58','2025-11-22 13:05:34','加藤','陽太','カトウ','ヨウタ','1985-08-03',40,1,'460-0001','愛知県','名古屋市中区','金山9-13-14','06-8068-8689','085-9590-5233',NULL,'user100@example.com',20,18,1,46,'慢性的な肩こりで来院。姿勢改善のアドバイス済み。'),(257,'2025-11-22 12:57:58','2025-11-22 12:57:58','田中','勇気','タナカ','ユウキ','1998-02-09',27,1,'980-0001','宮城県','仙台市青葉区','本町1-19-8','08-8500-1282','075-6430-4627',NULL,'user101@example.com',NULL,NULL,0,8,'膝の痛みで来院。歩行時の違和感が軽減してきた。'),(258,'2025-11-22 12:57:58','2025-11-22 12:57:58','清水','拓也','シミズ','タクヤ','2000-12-24',24,1,'150-0001','東京都','渋谷区','神宮前3-21-6','08-1668-4022','081-5174-4580',NULL,'user102@example.com',NULL,NULL,0,29,'定期的な施術を希望されている。腰痛の改善が見られる。'),(259,'2025-11-22 12:57:58','2025-11-22 13:05:34','岡本','拓也','オカモト','タクヤ','1994-04-06',31,1,'220-0001','神奈川県','横浜市西区','南幸4-4-16','04-7463-2054','081-9070-7507',NULL,'user103@example.com',6,4,0,20,'交通事故後のリハビリ目的。保険適用。'),(260,'2025-11-22 12:57:58','2025-11-22 12:57:58','村上','拓也','ムラカミ','タクヤ','1956-11-23',68,1,'220-0001','神奈川県','横浜市西区','平沼4-19-13','08-8806-6263','070-6884-4982',NULL,'user104@example.com',NULL,NULL,1,5,'高齢のため、優しい施術を心がける。'),(261,'2025-11-22 12:57:58','2025-11-22 12:57:58','石川','颯太','イシカワ','ソウタ','1947-01-09',78,1,'812-0001','福岡県','福岡市博多区','住吉8-1-18','03-5619-5149','079-1986-2792',NULL,'user105@example.com',NULL,NULL,0,44,'定期健診で姿勢の悪さを指摘され来院。'),(262,'2025-11-22 12:57:58','2025-11-22 12:57:58','藤田','美月','フジタ','ミヅキ','1996-05-24',29,2,'220-0001','神奈川県','横浜市西区','平沼9-1-3','07-6820-1924','088-1762-2401',NULL,'user106@example.com',NULL,NULL,1,12,'膝の痛みで来院。歩行時の違和感が軽減してきた。'),(263,'2025-11-22 12:57:58','2025-11-22 12:57:58','太田','凛','オオタ','リン','1988-07-18',37,2,'730-0001','広島県','広島市中区','紙屋町4-22-16','06-4735-3449','090-8371-2123',NULL,'user107@example.com',NULL,NULL,0,13,NULL),(264,'2025-11-22 12:57:58','2025-11-22 13:05:34','遠藤','彩','エンドウ','アヤ','1955-01-20',70,2,'220-0001','神奈川県','横浜市西区','高島6-15-3','08-8365-7565','080-9048-7721','03-3765-9791',NULL,10,8,1,38,'足のしびれがあり、整形外科と併用中。'),(265,'2025-11-22 12:57:58','2025-11-22 12:57:58','石井','裕子','イシイ','ユウコ','1953-01-15',72,2,'220-0001','神奈川県','横浜市西区','高島7-3-5','06-3120-7228','089-6210-4053',NULL,NULL,NULL,NULL,0,39,NULL),(266,'2025-11-22 12:57:58','2025-11-22 12:57:58','小林','和子','コバヤシ','カズコ','1972-02-29',53,2,'600-0001','京都府','京都市下京区','祇園4-14-3','06-2307-3597','090-3972-6324',NULL,'user110@example.com',NULL,NULL,1,29,'ストレスによる全身の緊張が強い。'),(267,'2025-11-22 12:57:58','2025-11-22 13:05:34','藤田','和子','フジタ','カズコ','1990-04-10',35,2,'260-0001','千葉県','千葉市中央区','富士見2-17-9','08-1536-8693','074-3066-4065',NULL,'user111@example.com',20,18,0,38,NULL),(268,'2025-11-22 12:57:58','2025-11-22 13:05:34','阿部','明美','アベ','アケミ','2005-06-16',20,2,'650-0001','兵庫県','神戸市中央区','元町7-6-1','08-7042-3042','080-1309-5825','08-4872-6479',NULL,5,3,0,35,'妊娠中のため、体位に配慮した施術が必要。'),(269,'2025-11-22 12:57:58','2025-11-22 13:05:34','林','大翔','ハヤシ','ヒロト','1948-08-21',77,1,'150-0001','東京都','渋谷区','神宮前3-2-9','03-5384-7459','081-9463-8659',NULL,'user113@example.com',11,9,0,48,'在宅勤務が増え、肩や背中のこりが悪化。'),(270,'2025-11-22 12:57:58','2025-11-22 12:57:58','長谷川','香織','ハセガワ','カオリ','2001-11-27',23,2,'600-0001','京都府','京都市下京区','祇園4-15-2','05-9540-2597','074-5440-4702','05-4649-3470',NULL,NULL,NULL,0,36,'首のこりと頭痛の症状あり。デスクワークが多い。'),(271,'2025-11-22 12:57:58','2025-11-22 12:57:58','藤田','愛','フジタ','アイ','1989-06-01',36,2,'150-0001','東京都','渋谷区','神宮前1-13-1','06-2349-6746','071-4151-2793','06-9166-6161','user115@example.com',NULL,NULL,0,15,'睡眠の質が悪いとのこと。リラクゼーション重視。'),(272,'2025-11-22 12:57:58','2025-11-22 13:05:34','前田','明美','マエダ','アケミ','1962-01-29',63,2,'460-0001','愛知県','名古屋市中区','錦4-29-4','09-4776-5141','088-7586-9275','06-7441-3946',NULL,4,2,0,28,NULL),(273,'2025-11-22 12:57:58','2025-11-22 12:57:58','石川','浩','イシカワ','ヒロシ','1982-04-23',43,1,'650-0001','兵庫県','神戸市中央区','旧居留地3-28-10','06-7678-4673','077-5887-4656','05-4463-5473','user117@example.com',NULL,NULL,0,29,'定期健診で姿勢の悪さを指摘され来院。'),(274,'2025-11-22 12:57:58','2025-11-22 13:05:34','橋本','太郎','ハシモト','タロウ','1948-06-26',77,1,'980-0001','宮城県','仙台市青葉区','一番町2-2-11','09-8552-9083','075-5329-4986',NULL,NULL,5,3,0,35,'在宅勤務が増え、肩や背中のこりが悪化。'),(275,'2025-11-22 12:57:58','2025-11-22 12:57:58','遠藤','美穂','エンドウ','ミホ','1950-04-15',75,2,'530-0001','大阪府','大阪市北区','中之島9-30-2','09-3189-8453','082-3657-1012',NULL,'user119@example.com',NULL,NULL,1,29,'首のこりと頭痛の症状あり。デスクワークが多い。'),(276,'2025-11-22 12:57:58','2025-11-22 12:57:58','佐藤','勇気','サトウ','ユウキ','1967-12-13',57,1,'260-0001','千葉県','千葉市中央区','中央9-18-10','08-7995-4233','079-1621-1837',NULL,'user120@example.com',3,1,0,25,'長時間の立ち仕事による足のむくみが気になる。'),(277,'2025-11-22 12:57:58','2025-11-22 13:05:34','清水','翔太','シミズ','ショウタ','1959-09-07',66,1,'600-0001','京都府','京都市下京区','祇園1-30-15','06-3693-4716','078-3715-4406','07-4480-5869','user121@example.com',7,5,0,41,'高齢のため、優しい施術を心がける。'),(278,'2025-11-22 12:57:58','2025-11-22 13:05:34','前田','和子','マエダ','カズコ','2003-02-13',22,2,'980-0001','宮城県','仙台市青葉区','花京院4-26-3','03-7452-8194','089-5579-5102',NULL,'user122@example.com',4,2,0,10,'冷え性がひどく、全身のマッサージを希望。'),(279,'2025-11-22 12:57:58','2025-11-22 15:40:36','渡辺','凛','ワタナベ','リン','2003-05-09',22,2,'220-0001','神奈川県','横浜市西区','高島2-15-13','09-5361-1692','080-2151-9147',NULL,'user123@example.com',7,5,1,15,'頭痛の症状あり。現在服用中の薬の関係で、治療にあたってはできる限り薬に頼りたくないとのこと。\r\n漢方は幼少期から現在に至るまで積極的に使用している。\r\n長時間の立ち仕事による足のむくみが気になる。定期的な施術を希望されている。\r\n自宅でストレッチやマッサージなどに取り組まれておられる模様。'),(280,'2025-11-22 12:57:58','2025-11-22 12:57:58','加藤','美咲','カトウ','ミサキ','1949-06-23',76,2,'160-0001','東京都','新宿区','高田馬場3-24-9','06-8171-2432','088-3171-7701',NULL,'user124@example.com',NULL,NULL,0,37,'運動後の筋肉痛のケアで来院。スポーツ選手。'),(281,'2025-11-22 12:57:58','2025-11-22 13:05:34','橋本','葵','ハシモト','アオイ','1946-09-22',79,2,'330-0001','埼玉県','さいたま市大宮区','大宮9-19-6','03-4793-7620','084-1046-5367',NULL,NULL,7,5,1,8,'ストレスによる全身の緊張が強い。'),(282,'2025-11-22 12:57:58','2025-11-22 13:05:34','藤田','修','フジタ','オサム','1949-05-31',76,1,'600-0001','京都府','京都市下京区','四条9-27-10','05-2163-3936','081-4581-6713',NULL,'user126@example.com',16,14,0,10,'スポーツ外傷後のケア。競技復帰を目指している。'),(283,'2025-11-22 12:57:58','2025-11-22 12:57:58','石井','舞','イシイ','マイ','1972-07-09',53,2,'150-0001','東京都','渋谷区','神宮前3-27-16','03-9563-8890','070-5315-2555',NULL,NULL,NULL,NULL,0,3,'肩こりがひどく、週2回の施術を継続中。'),(284,'2025-11-22 12:57:58','2025-11-22 12:57:58','清水','楓','シミズ','カエデ','2005-04-14',20,2,'100-0001','東京都','千代田区','日比谷4-23-13','04-3959-6468','087-5500-8164',NULL,'user128@example.com',NULL,NULL,0,44,'運動後の筋肉痛のケアで来院。スポーツ選手。'),(285,'2025-11-22 12:57:58','2025-11-22 12:57:58','田中','琴音','タナカ','コトネ','1957-03-16',68,2,'060-0001','北海道','札幌市中央区','円山5-13-17','05-5841-9519','085-7200-5961',NULL,'user129@example.com',NULL,NULL,0,28,NULL),(286,'2025-11-22 12:57:58','2025-11-22 12:57:58','石井','真由美','イシイ','マユミ','1963-10-12',62,2,'812-0001','福岡県','福岡市博多区','住吉8-1-11','07-8825-2389','070-7809-2930',NULL,'user130@example.com',NULL,NULL,0,41,NULL),(287,'2025-11-22 12:57:58','2025-11-22 12:57:58','井上','美咲','イノウエ','ミサキ','2004-04-27',21,2,'460-0001','愛知県','名古屋市中区','錦7-7-16','05-2179-2422','071-2077-5260',NULL,'user131@example.com',NULL,NULL,1,22,'ストレスによる全身の緊張が強い。'),(288,'2025-11-22 12:57:58','2025-11-22 13:05:34','後藤','学','ゴトウ','マナブ','2003-04-28',22,1,'542-0001','大阪府','大阪市中央区','難波9-21-16','05-4223-2127','078-8861-9815',NULL,'user132@example.com',1,NULL,1,16,'冷え性がひどく、全身のマッサージを希望。'),(289,'2025-11-22 12:57:58','2025-11-22 12:57:58','中野','莉子','ナカノ','リコ','1973-05-08',52,2,'530-0001','大阪府','大阪市北区','堂島9-14-7','03-1372-6619','086-8559-5905',NULL,NULL,NULL,NULL,0,46,'ストレスによる全身の緊張が強い。'),(290,'2025-11-22 12:57:58','2025-11-22 12:57:58','鈴木','太郎','スズキ','タロウ','1979-01-18',46,1,'542-0001','大阪府','大阪市中央区','本町8-23-10','05-2861-8381','072-8187-9640','07-7277-4563',NULL,NULL,NULL,0,31,'定期健診で姿勢の悪さを指摘され来院。'),(291,'2025-11-22 12:57:58','2025-11-22 12:57:58','山田','琴音','ヤマダ','コトネ','1962-06-07',63,2,'330-0001','埼玉県','さいたま市大宮区','仲町3-9-6','09-5417-9003','078-4765-5546',NULL,'user135@example.com',NULL,NULL,1,14,'在宅勤務が増え、肩や背中のこりが悪化。'),(292,'2025-11-22 12:57:58','2025-11-22 13:05:34','山本','美月','ヤマモト','ミヅキ','1977-03-19',48,2,'460-0001','愛知県','名古屋市中区','大須9-30-19','08-1892-2550','072-7414-2520',NULL,'user136@example.com',13,11,0,1,'妊娠中のため、体位に配慮した施術が必要。'),(293,'2025-11-22 12:57:58','2025-11-22 12:57:58','森','修','モリ','オサム','1943-03-31',82,1,'650-0001','兵庫県','神戸市中央区','北野1-2-10','03-2310-5630','085-8129-5386',NULL,NULL,NULL,NULL,0,7,'睡眠の質が悪いとのこと。リラクゼーション重視。'),(294,'2025-11-22 12:57:58','2025-11-22 12:57:58','西村','勇気','ニシムラ','ユウキ','2002-02-06',23,1,'060-0001','北海道','札幌市中央区','すすきの6-24-20','06-2309-5474','090-9834-1082',NULL,'user138@example.com',NULL,NULL,0,30,NULL),(295,'2025-11-22 12:57:58','2025-11-22 13:05:34','遠藤','雄一','エンドウ','ユウイチ','1984-04-07',41,1,'100-0001','東京都','千代田区','大手町7-6-20','09-6154-7209','081-7075-1450',NULL,'user139@example.com',4,2,0,5,'定期健診で姿勢の悪さを指摘され来院。'),(296,'2025-11-22 12:57:58','2025-11-22 13:05:34','阿部','恵子','アベ','ケイコ','1975-07-29',50,2,'650-0001','兵庫県','神戸市中央区','三宮2-30-5','05-9493-3497','082-9493-2729',NULL,NULL,19,17,0,50,'首のこりと頭痛の症状あり。デスクワークが多い。'),(297,'2025-11-22 12:57:58','2025-11-22 13:05:34','井上','直樹','イノウエ','ナオキ','1979-05-24',46,1,'530-0001','大阪府','大阪市北区','堂島1-19-3','03-9927-6706','084-6708-3510',NULL,'user141@example.com',4,2,0,0,'冷え性がひどく、全身のマッサージを希望。'),(298,'2025-11-22 12:57:58','2026-01-26 14:26:39','青木','明美','アオキ','アケミ','2025-10-10',0,2,'460-0001','愛知県','名古屋市中区','大須6-23-14','07-7630-4782','078-1774-4118',NULL,NULL,15,13,0,16,'頭痛持ちで薬に頼りたくないとのこと。'),(299,'2025-11-22 12:57:58','2025-11-22 12:57:58','近藤','琴音','コンドウ','コトネ','1989-02-20',36,2,'220-0001','神奈川県','横浜市西区','みなとみらい6-18-17','05-6115-7654','086-4099-8340',NULL,NULL,NULL,NULL,0,23,'首のこりと頭痛の症状あり。デスクワークが多い。'),(300,'2025-11-22 12:57:58','2025-11-22 12:57:58','小川','学','オガワ','マナブ','1985-10-25',40,1,'060-0001','北海道','札幌市中央区','すすきの4-22-10','08-5279-4181','090-9267-2759',NULL,'user144@example.com',NULL,NULL,0,49,'冷え性がひどく、全身のマッサージを希望。'),(301,'2025-11-22 12:57:58','2025-11-22 13:05:34','斎藤','修','サイトウ','オサム','1943-03-17',82,1,'100-0001','東京都','千代田区','丸の内8-25-7','03-8388-8534','072-7337-5639','03-9905-3963',NULL,3,1,0,36,'足のしびれがあり、整形外科と併用中。'),(302,'2025-11-22 12:57:58','2025-11-22 12:57:58','森','芽依','モリ','メイ','1952-05-03',73,2,'160-0001','東京都','新宿区','高田馬場2-5-11','04-5849-6199','088-6303-2811',NULL,'user146@example.com',NULL,NULL,0,23,'慢性的な肩こりで来院。姿勢改善のアドバイス済み。'),(303,'2025-11-22 12:57:58','2025-11-22 12:57:58','石井','裕二','イシイ','ユウジ','1947-10-30',78,1,'530-0001','大阪府','大阪市北区','中之島5-22-15','08-5520-2639','072-7563-2634','05-3829-1510','user147@example.com',NULL,NULL,0,12,'首のこりと頭痛の症状あり。デスクワークが多い。'),(304,'2025-11-22 12:57:58','2025-11-22 13:05:34','竹田','大輝','タケダ','ダイキ','1992-01-01',33,1,'980-0001','宮城県','仙台市青葉区','一番町9-24-14','05-5146-5830','080-9320-2123','08-6683-8995',NULL,12,10,0,29,NULL),(305,'2025-11-22 12:57:58','2025-11-22 12:57:58','村上','颯太','ムラカミ','ソウタ','2000-02-11',25,1,'600-0001','京都府','京都市下京区','烏丸4-22-7','03-2731-2591','088-5169-2538','06-2647-5863','user149@example.com',NULL,NULL,0,49,'運動後の筋肉痛のケアで来院。スポーツ選手。'),(306,'2025-11-22 12:57:58','2025-11-22 12:57:58','原田','遥','ハラダ','ハルカ','1977-07-26',48,2,'330-0001','埼玉県','さいたま市大宮区','宮町9-11-10','09-9567-5252','076-7942-7632',NULL,'user150@example.com',NULL,NULL,1,11,'産後の骨盤矯正を希望。育児中のため時間調整必要。');
/*!40000 ALTER TABLE `clinic_users` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `conditions`
--

DROP TABLE IF EXISTS `conditions`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `conditions` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `created_at` datetime NOT NULL DEFAULT current_timestamp(),
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `condition_name` varchar(255) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=8 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='発病負傷経過';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `conditions`
--

LOCK TABLES `conditions` WRITE;
/*!40000 ALTER TABLE `conditions` DISABLE KEYS */;
INSERT INTO `conditions` VALUES (1,'2025-11-12 12:43:16','2025-11-12 12:43:16','CCCCC'),(2,'2025-11-13 13:17:19','2025-11-13 13:17:19','AAAAA'),(3,'2025-11-15 12:08:26','2025-11-15 12:08:26','BBBBB'),(4,'2025-12-12 10:55:47','2025-12-12 10:55:47','良好'),(5,'2025-12-17 13:34:20','2025-12-17 13:34:20','おおむね良好'),(6,'2026-01-09 13:48:29','2026-01-09 13:48:29','発病負傷経過テスト01'),(7,'2026-01-10 12:41:52','2026-01-10 12:41:52','悪化');
/*!40000 ALTER TABLE `conditions` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `consents_acupuncture`
--

DROP TABLE IF EXISTS `consents_acupuncture`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `consents_acupuncture` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `created_at` datetime NOT NULL DEFAULT current_timestamp(),
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `clinic_user_id` int(11) NOT NULL,
  `consenting_date` date DEFAULT NULL,
  `consenting_start_date` date DEFAULT NULL,
  `consenting_end_date` date DEFAULT NULL,
  `benefit_period_start_date` date DEFAULT NULL,
  `benefit_period_end_date` date DEFAULT NULL,
  `first_care_date` date DEFAULT NULL,
  `reconsenting_expiry` date DEFAULT NULL,
  `bill_category_id` int(11) DEFAULT NULL,
  `outcome_id` int(11) DEFAULT NULL,
  `illness_name_acupuncture_id` int(11) DEFAULT NULL,
  `illness_name_acupuncture_addendum` varchar(255) DEFAULT NULL,
  `is_housecall_required` tinyint(1) DEFAULT NULL,
  `housecall_reason_id` bigint(20) unsigned DEFAULT NULL,
  `housecall_reason_addendum` varchar(255) DEFAULT NULL,
  `therapy_period` varchar(255) DEFAULT NULL,
  `therapy_period_start_date` date DEFAULT NULL,
  `therapy_period_end_date` date DEFAULT NULL,
  `first_therapy_content_id` int(11) DEFAULT NULL,
  `condition` int(11) DEFAULT NULL,
  `work_scope_type_id` int(11) DEFAULT NULL,
  `onset_and_injury_date` date DEFAULT NULL,
  `consenting_doctor_id` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `cdh_acupuncture_illness_names_acupuncture_FK` (`illness_name_acupuncture_id`),
  KEY `concenting_doctor_history_acupuncture_bill_categories_FK` (`bill_category_id`),
  KEY `concenting_doctor_history_acupuncture_outcomes_FK` (`outcome_id`),
  KEY `idx_clinic_user_id` (`clinic_user_id`),
  KEY `consents_acupuncture_housecall_reason_id_foreign` (`housecall_reason_id`),
  KEY `consents_acupuncture_consenting_doctor_id_foreign` (`consenting_doctor_id`),
  CONSTRAINT `cdh_acupuncture_illness_names_acupuncture_FK` FOREIGN KEY (`illness_name_acupuncture_id`) REFERENCES `illnesses_acupuncture` (`id`),
  CONSTRAINT `concenting_doctor_history_acupuncture_bill_categories_FK` FOREIGN KEY (`bill_category_id`) REFERENCES `bill_categories` (`id`),
  CONSTRAINT `concenting_doctor_history_acupuncture_outcomes_FK` FOREIGN KEY (`outcome_id`) REFERENCES `outcomes` (`id`),
  CONSTRAINT `consents_acupuncture_consenting_doctor_id_foreign` FOREIGN KEY (`consenting_doctor_id`) REFERENCES `doctors` (`id`) ON DELETE SET NULL,
  CONSTRAINT `consents_acupuncture_housecall_reason_id_foreign` FOREIGN KEY (`housecall_reason_id`) REFERENCES `housecall_reasons` (`id`) ON DELETE SET NULL,
  CONSTRAINT `fk_ccdha_clinic_user_id` FOREIGN KEY (`clinic_user_id`) REFERENCES `clinic_users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=10 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='同意医師履歴情報（はり・きゅう）';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `consents_acupuncture`
--

LOCK TABLES `consents_acupuncture` WRITE;
/*!40000 ALTER TABLE `consents_acupuncture` DISABLE KEYS */;
INSERT INTO `consents_acupuncture` VALUES (6,'2026-01-09 13:48:29','2026-02-18 14:44:03',214,'2026-01-01','2026-01-02','2026-01-03','2026-01-04','2026-01-05','2026-01-06','2026-01-07',1,1,5,NULL,0,NULL,NULL,'3ヶ月','2026-01-02','2026-01-22',NULL,6,3,'2026-01-30',5),(7,'2026-02-26 13:52:04','2026-02-26 13:52:04',298,'2025-08-05','2025-08-05','2026-02-28','2025-08-05','2026-02-28',NULL,'2026-02-28',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'2025-08-05','2026-02-28',NULL,NULL,NULL,NULL,5),(8,'2026-02-26 13:56:11','2026-02-26 13:56:11',298,'2024-11-10','2024-11-10','2025-05-31','2024-11-10','2025-05-31',NULL,'2025-05-31',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'2024-11-10','2025-05-31',NULL,NULL,NULL,NULL,6),(9,'2026-02-27 10:54:02','2026-02-27 10:57:57',157,'2025-10-10','2025-10-10','2026-04-30','2025-10-10','2026-04-30','2025-03-13','2026-04-30',1,1,5,NULL,1,2,NULL,NULL,'2025-10-10','2026-04-30',13,6,1,'2025-07-05',5);
/*!40000 ALTER TABLE `consents_acupuncture` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `consents_massage`
--

DROP TABLE IF EXISTS `consents_massage`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `consents_massage` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `created_at` datetime NOT NULL DEFAULT current_timestamp(),
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `clinic_user_id` int(11) NOT NULL,
  `consenting_doctor_id` int(11) DEFAULT NULL,
  `consenting_date` date DEFAULT NULL,
  `consenting_start_date` date DEFAULT NULL,
  `consenting_end_date` date DEFAULT NULL,
  `benefit_period_start_date` date DEFAULT NULL,
  `benefit_period_end_date` date DEFAULT NULL,
  `first_care_date` date DEFAULT NULL,
  `injury_and_illness_name_id` int(11) DEFAULT NULL,
  `reconsenting_expiry` date DEFAULT NULL,
  `bill_category_id` int(11) DEFAULT NULL,
  `outcome_id` int(11) DEFAULT NULL,
  `is_symptom_1` tinyint(1) DEFAULT NULL,
  `is_symptom_2` tinyint(1) DEFAULT NULL,
  `symtom_2_addendum` varchar(255) DEFAULT NULL,
  `is_symptom_3` tinyint(1) DEFAULT NULL,
  `symtom_3_addendum` varchar(255) DEFAULT NULL,
  `is_therapy_type_1` tinyint(1) DEFAULT NULL,
  `is_therapy_type_2` tinyint(1) DEFAULT NULL,
  `is_housecall_required` tinyint(1) DEFAULT NULL,
  `housecall_reason_id` int(11) DEFAULT NULL,
  `housecall_reason_addendum` varchar(255) DEFAULT NULL,
  `care_level` varchar(255) DEFAULT NULL,
  `notes` varchar(255) DEFAULT NULL,
  `therapy_period` varchar(255) DEFAULT NULL,
  `therapy_period_start_date` date DEFAULT NULL,
  `therapy_period_end_date` date DEFAULT NULL,
  `first_therapy_content_id` int(11) DEFAULT NULL,
  `condition_id` int(11) DEFAULT NULL,
  `work_scope_type_id` int(11) DEFAULT NULL,
  `onset_and_injury_date` date DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `accepted_doctor_history_massage_injury_and_illness_names_FK` (`injury_and_illness_name_id`),
  KEY `concenting_doctor_history_massage_therapy_conetnts_FK` (`first_therapy_content_id`),
  KEY `concenting_doctor_history_massage_conditions_FK` (`condition_id`),
  KEY `concenting_doctor_history_massage_work_scope_types_FK` (`work_scope_type_id`),
  KEY `concenting_doctor_history_massage_outcomes_FK` (`outcome_id`),
  KEY `idx_clinic_user_id` (`clinic_user_id`),
  KEY `consents_massage_consenting_doctor_id_foreign` (`consenting_doctor_id`),
  CONSTRAINT `accepted_doctor_history_massage_injury_and_illness_names_FK` FOREIGN KEY (`injury_and_illness_name_id`) REFERENCES `illnesses_massage` (`id`),
  CONSTRAINT `concenting_doctor_history_massage_conditions_FK` FOREIGN KEY (`condition_id`) REFERENCES `conditions` (`id`),
  CONSTRAINT `concenting_doctor_history_massage_outcomes_FK` FOREIGN KEY (`outcome_id`) REFERENCES `outcomes` (`id`),
  CONSTRAINT `concenting_doctor_history_massage_therapy_conetnts_FK` FOREIGN KEY (`first_therapy_content_id`) REFERENCES `therapy_contents` (`id`),
  CONSTRAINT `concenting_doctor_history_massage_work_scope_types_FK` FOREIGN KEY (`work_scope_type_id`) REFERENCES `work_scope_types` (`id`),
  CONSTRAINT `consents_massage_consenting_doctor_id_foreign` FOREIGN KEY (`consenting_doctor_id`) REFERENCES `doctors` (`id`) ON DELETE SET NULL,
  CONSTRAINT `fk_ccdhm_clinic_user_id` FOREIGN KEY (`clinic_user_id`) REFERENCES `clinic_users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=19 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='同意医師履歴（あんま・マッサージ）';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `consents_massage`
--

LOCK TABLES `consents_massage` WRITE;
/*!40000 ALTER TABLE `consents_massage` DISABLE KEYS */;
INSERT INTO `consents_massage` VALUES (17,'2026-01-10 12:41:52','2026-02-26 13:56:57',298,5,'2025-07-16','2025-07-16','2026-01-31','2025-07-16','2026-01-31',NULL,7,'2026-01-31',2,4,1,0,NULL,0,NULL,1,0,1,2,NULL,'要支援１','注意事項等テスト',NULL,'2025-07-16','2026-01-31',18,7,3,'2026-01-09'),(18,'2026-02-27 10:56:04','2026-02-27 10:56:04',157,6,'2025-09-07','2025-09-07','2026-03-31','2025-09-07','2026-03-31','2025-08-02',5,'2026-03-31',1,1,1,1,NULL,0,NULL,1,1,1,3,NULL,'要介護度テスト０１',NULL,NULL,'2025-09-07','2026-03-31',18,6,2,'2025-02-12');
/*!40000 ALTER TABLE `consents_massage` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `deposits`
--

DROP TABLE IF EXISTS `deposits`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `deposits` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `clinic_user_id` int(11) DEFAULT NULL,
  `year_month` varchar(7) DEFAULT NULL,
  `created_at` datetime NOT NULL DEFAULT current_timestamp(),
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `insurer_id` int(11) DEFAULT NULL,
  `insured_name` varchar(255) DEFAULT NULL,
  `therapy_period_start` date DEFAULT NULL,
  `therapy_period_end` date DEFAULT NULL,
  `treatment_type` varchar(255) DEFAULT NULL,
  `treatment_dates` text DEFAULT NULL,
  `total_amount` int(11) DEFAULT NULL,
  `selfpay_amount` int(11) DEFAULT NULL,
  `insurance_billing_amount` int(11) DEFAULT NULL,
  `deposit_amount` int(11) DEFAULT NULL,
  `deposit_date` date DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `deposits_insurers_FK` (`insurer_id`),
  CONSTRAINT `deposits_insurers_FK` FOREIGN KEY (`insurer_id`) REFERENCES `insurers` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=18 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='入金管理';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `deposits`
--

LOCK TABLES `deposits` WRITE;
/*!40000 ALTER TABLE `deposits` DISABLE KEYS */;
INSERT INTO `deposits` VALUES (1,298,'2025-12','2025-12-12 15:14:29','2026-02-20 13:15:28',23,'AAAAA','2025-12-01','2025-12-18','1','[\"2025-12-01\",\"2025-12-08\",\"2025-12-10\",\"2025-12-11\",\"2025-12-13\",\"2025-12-18\"]',12500,5000,2400,3444,'2025-12-03'),(2,298,'2025-12','2025-12-12 15:14:29','2026-02-20 13:15:30',23,'AAAAA','2025-12-04','2025-12-29','2','[\"2025-12-04\",\"2025-12-04\",\"2025-12-06\",\"2025-12-08\",\"2025-12-12\",\"2025-12-12\",\"2025-12-15\",\"2025-12-18\",\"2025-12-20\",\"2025-12-20\",\"2025-12-25\",\"2025-12-27\",\"2025-12-29\"]',0,0,0,8111,'2026-02-05'),(3,298,'2025-06','2025-12-12 15:14:29','2026-02-20 13:15:51',23,'AAAAA','2025-06-04','2025-06-04','1','[\"2025-06-04\"]',0,0,0,444,'2026-02-13'),(4,298,'2025-08','2025-12-12 15:14:29','2026-02-20 13:15:43',23,'AAAAA','2025-08-13','2025-08-13','1','[\"2025-08-13\"]',0,0,0,555,'2026-02-11'),(5,241,'2025-12','2025-12-12 15:14:30','2026-02-20 13:15:31',24,NULL,'2025-12-10','2025-12-10','1','[\"2025-12-10\"]',0,0,0,255,'2026-02-07'),(6,241,'2025-12','2025-12-12 15:14:30','2026-02-20 13:15:32',25,NULL,'2025-12-10','2025-12-10','1','[\"2025-12-10\"]',0,0,0,255,'2026-02-09'),(7,298,'2024-06','2025-12-13 13:42:20','2026-02-20 13:16:07',23,'AAAAA','2024-06-05','2024-06-10','1','[\"2024-06-05\",\"2024-06-10\"]',0,0,0,1111,'2026-02-09'),(8,298,'2022-10','2025-12-13 13:43:14','2026-02-20 13:12:02',23,'AAAAA','2022-10-12','2022-10-12','2','[\"2022-10-12\"]',0,0,0,888,'2024-11-12'),(9,298,'2022-04','2025-12-13 13:43:48','2026-02-20 13:12:18',23,'AAAAA','2022-04-21','2022-04-29','1','[\"2022-04-21\",\"2022-04-22\",\"2022-04-25\",\"2022-04-27\",\"2022-04-29\"]',0,0,0,2666,'2026-05-14'),(10,298,'2026-01','2026-01-07 11:49:13','2026-02-20 13:13:51',23,'AAAAA','2026-01-02','2026-01-22','1','[\"2026-01-02\",\"2026-01-10\",\"2026-01-22\"]',0,0,0,1444,'2026-02-22'),(11,298,'2026-01','2026-01-07 11:50:36','2026-02-20 13:14:25',23,'AAAAA','2026-01-05','2026-01-14','2','[\"2026-01-05\",\"2026-01-14\"]',0,0,0,666,'2026-02-24'),(12,298,'2026-01','2026-01-09 11:48:04','2026-02-20 13:14:30',26,'AAAAA','2026-01-01','2026-01-31','1','[\"2026-01-01\",\"2026-01-02\",\"2026-01-10\",\"2026-01-12\",\"2026-01-19\",\"2026-01-22\",\"2026-01-24\",\"2026-01-29\",\"2026-01-30\",\"2026-01-31\"]',0,0,0,3333,'2026-02-26'),(13,298,'2026-01','2026-01-09 11:48:31','2026-02-20 13:14:33',26,'AAAAA','2026-01-05','2026-01-26','2','[\"2026-01-05\",\"2026-01-07\",\"2026-01-07\",\"2026-01-14\",\"2026-01-26\"]',0,0,0,2555,'2026-02-28'),(14,214,'2026-01','2026-01-09 13:44:15','2026-02-20 13:14:03',28,'青木俊介','2026-01-02','2026-01-05','1','[\"2026-01-02\",\"2026-01-03\",\"2026-01-05\"]',0,0,0,2777,'2026-03-02'),(15,298,'2026-02','2026-02-04 15:48:58','2026-02-20 13:13:21',26,'AAAAA','2026-02-25','2026-02-25','1','[\"2026-02-25\"]',0,0,0,333,'2026-02-16'),(16,298,'2026-04','2026-02-04 15:58:24','2026-02-20 13:12:36',26,'AAAAA','2026-04-01','2026-04-01','1','[\"2026-04-01\"]',0,0,0,333,'2027-07-20'),(17,298,'2026-02','2026-02-10 10:28:37','2026-02-20 13:13:28',26,'AAAAA','2026-02-07','2026-02-28','2','[\"2026-02-07\",\"2026-02-16\",\"2026-02-21\",\"2026-02-21\",\"2026-02-26\",\"2026-02-26\",\"2026-02-26\",\"2026-02-27\",\"2026-02-28\"]',0,0,0,5555,'2026-02-18');
/*!40000 ALTER TABLE `deposits` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `doctors`
--

DROP TABLE IF EXISTS `doctors`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `doctors` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `created_at` datetime NOT NULL DEFAULT current_timestamp(),
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `last_name` varchar(255) DEFAULT NULL,
  `first_name` varchar(255) DEFAULT NULL,
  `last_name_kana` varchar(255) DEFAULT NULL,
  `first_name_kana` varchar(255) DEFAULT NULL,
  `medical_institutions_id` int(11) DEFAULT NULL,
  `postal_code` varchar(255) DEFAULT NULL,
  `address_1` varchar(255) DEFAULT NULL,
  `address_2` varchar(255) DEFAULT NULL,
  `address_3` varchar(255) DEFAULT NULL,
  `phone` varchar(255) DEFAULT NULL,
  `cell_phone` varchar(255) DEFAULT NULL,
  `fax` varchar(255) DEFAULT NULL,
  `email` varchar(255) DEFAULT NULL,
  `note` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `doctors_medical_institutions_FK` (`medical_institutions_id`),
  CONSTRAINT `doctors_medical_institutions_FK` FOREIGN KEY (`medical_institutions_id`) REFERENCES `medical_institutions` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='医師';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `doctors`
--

LOCK TABLES `doctors` WRITE;
/*!40000 ALTER TABLE `doctors` DISABLE KEYS */;
INSERT INTO `doctors` VALUES (5,'2025-12-12 10:28:05','2026-02-18 14:38:13','伊司田','一郎','イシダ','イチロウ',5,'880-0002','宮崎県','宮崎市中央通254-2',NULL,'03-1234-5678','090-9876-5432',NULL,NULL,NULL),(6,'2026-02-14 12:47:56','2026-02-18 14:38:13','狭間','黒男','ハザマ','クロオ',6,'110-0002','東京都','台東区上野桜木',NULL,'0000000000','00000000000','0000000000',NULL,NULL);
/*!40000 ALTER TABLE `doctors` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `document_association`
--

DROP TABLE IF EXISTS `document_association`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `document_association` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `created_at` datetime NOT NULL DEFAULT current_timestamp(),
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `document_id_1` int(11) DEFAULT NULL,
  `document_id_2` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `document_association_documents_FK_1` (`document_id_1`),
  KEY `document_association_documents_FK_2` (`document_id_2`),
  CONSTRAINT `document_association_documents_FK_2` FOREIGN KEY (`document_id_2`) REFERENCES `documents` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=16 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='文書関連付け';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `document_association`
--

LOCK TABLES `document_association` WRITE;
/*!40000 ALTER TABLE `document_association` DISABLE KEYS */;
INSERT INTO `document_association` VALUES (1,'2026-02-13 11:51:27','2026-02-13 15:34:57',1,23),(2,'2026-02-13 11:51:29','2026-02-13 15:34:57',2,23),(3,'2026-02-13 15:14:47','2026-02-13 15:34:57',3,24),(4,'2026-02-13 15:14:49','2026-02-13 15:34:57',4,24),(5,'2026-02-13 15:32:36','2026-02-24 11:33:15',5,25),(6,'2026-02-13 15:32:38','2026-02-24 11:33:18',6,26),(7,'2026-02-13 15:32:39','2026-02-24 11:33:29',7,27),(8,'2026-02-13 15:32:41','2026-02-25 15:19:26',8,28),(9,'2026-02-13 15:32:42','2026-02-25 15:19:28',9,29),(10,'2026-02-13 15:32:44','2026-02-25 15:19:30',10,30),(11,'2026-02-13 15:32:45','2026-02-13 15:34:57',11,23),(12,'2026-02-13 15:32:47','2026-02-13 15:34:57',12,23),(13,'2026-02-13 15:32:49','2026-02-13 15:34:57',13,23),(14,'2026-02-13 15:32:51','2026-02-13 15:34:57',14,23),(15,'2026-02-13 15:32:52','2026-02-13 15:34:57',15,23);
/*!40000 ALTER TABLE `document_association` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `documents`
--

DROP TABLE IF EXISTS `documents`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `documents` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `created_at` datetime NOT NULL DEFAULT current_timestamp(),
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `document_category` varchar(255) DEFAULT NULL,
  `document_name` varchar(255) DEFAULT NULL,
  `content` text NOT NULL,
  `font_size` int(11) DEFAULT 12,
  `line_height` int(11) DEFAULT 7,
  PRIMARY KEY (`id`),
  KEY `documents_document_titles_FK` (`document_name`)
) ENGINE=InnoDB AUTO_INCREMENT=31 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='文書';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `documents`
--

LOCK TABLES `documents` WRITE;
/*!40000 ALTER TABLE `documents` DISABLE KEYS */;
INSERT INTO `documents` VALUES (23,'2026-02-13 10:50:37','2026-02-13 10:53:26','依頼状','同意書依頼状（サンプル版）','御担当医　御机下\r\n\r\n　謹啓　時下ますますご清栄のこととお喜び申し上げます。\r\n　さてご多忙中誠に恐れ入りますが、下記の方、健康保険によるマッサージ治療を希望いたしておりますので、ご高診を賜り別紙同意書に\r\nご同意下さいますようお願い申し上げます。\r\n\r\n　つきましては、鍼灸の支給対象は別紙同意書の中で、病名の欄につきましては、\r\n1～6までの該当する数字を○でお囲みいただければ幸いと存じます。\r\n\r\n　同意書記入のサンプルを同封いたしましたので、ご参考の上\r\nご記述していただければ幸いと存じます。\r\n\r\n　ご同意後の施術に関しましては、当院の責任において担当させていただきます。\r\n尚、診療報酬明細書に同意書交付時には\r\n「同意書交付料」が算定できることになっております。\r\n\r\n　今後とも、何卒よろしくお願いいたします。',12,7),(24,'2026-02-13 15:14:28','2026-02-13 15:14:28','依頼状','同意書依頼（医師指定）','謹啓　時下ますますご清栄のこととお喜び申し上げます。\r\n\r\n　さてご多忙中誠に恐れ入りますが、下記の方、健康保険によるマッサージ治療を\r\n希望いたしておりますので、ご高診を賜り別紙同意書に\r\nご同意下さいますようお願い申し上げます。\r\n\r\n　つきましては、鍼灸の支給対象は別紙同意書の中で、病名の欄につきましては、\r\n1～6までの該当する数字を○でお囲みいただければ幸いと存じます。\r\n\r\n　同意書記入のサンプルを同封いたしましたので、ご参考の上ご記述していただければ幸いと存じます。\r\n\r\n　ご同意後の施術に関しましては、当院の責任において担当させていただきます。\r\n　尚、診療報酬明細書に同意書交付時には\r\n「同意書交付料」が算定できることになっております。\r\n\r\n　今後も、関節拘縮の予防、痛みの暖解、足の浮腫み改善を主としたマッサージで少しでも生活の質があがるように努力いたしますのでよろしくお願い申し上げます。\r\n\r\n　ご不明な点がどございましたら、お気軽に御問い合わせください。\r\n\r\n　どうぞ、今後とも、何卒よろしくお願いいたします。',12,7),(25,'2026-02-24 11:23:34','2026-02-24 11:30:12','御礼状','医師への御礼状（同意書発行）','謹啓　時下ますますご清栄のこととお喜び申し上げます。\r\n\r\n　この度は、同意書の発行にご協力していただき心より御礼申し上げます。\r\n\r\n　下記の方の生活の質が少しでも向上するように努力いたしますので、ご指導やご指示がございましたらお伝えください。\r\n\r\n　今後、下記の方に関わる地域医療の一員としてケアマネージャー様を始め介護事業所や医療関係機関と連携をとらせて頂きながら務めさせていただきたいと思います。\r\n\r\n　今後とも、何卒よろしくお願いいたします。',12,7),(26,'2026-02-24 11:29:52','2026-02-24 11:29:52','御礼状','医師への御礼状（一般）','謹啓　時下ますますご清栄のこととお喜び申し上げます。\r\n\r\n　この度は、諸々の件に関してご協力していただき心より御礼申し上げます。\r\n\r\n　下記の方の生活の質が少しでも向上するように努力いたしますので、ご指導やご指示がございましたらお伝えください。\r\n\r\n　今後とも、何卒よろしくお願いいたします。',12,7),(27,'2026-02-24 11:31:44','2026-02-24 11:31:44','御礼状','紹介者への御礼状','謹啓　時下ますますご清栄のこととお喜び申し上げます。\r\n\r\n　この度は、下記の方に訪問リハビリマッサージをご紹介していただき心より御礼申し上げます。\r\n\r\n　下記の方の生活の質が少しでも向上するように努力いたしますので、ご指導やご指示がございましたらお伝えください。\r\n\r\n　今後、下記の方に関わる地域医療の一員としてケアマネージャー様を始め介護事業所や医療関係機関と連携をとらせて頂きながら務めさせていただきたいと思います。\r\n\r\n　今後とも、何卒よろしくお願いいたします。',12,7),(28,'2026-02-25 14:36:50','2026-02-25 14:41:11','挨拶状','報告書挨拶文（医師向け）','謹啓　時下ますますご清栄のこととお喜び申し上げます。\r\n\r\n　さて、現在健康保険によるマッサージ治療を継続中の下記の方の治療経過をご報告させていただきます。\r\n\r\n　本来なら、お伺いしてご報告申し上げるところ書面にて失礼させていただきます。\r\n　もし、先生の方で特別なご指示がない場合は、再同意日をもって、今後も別紙に記述したような治療を継続して行うことで治療効果をあげて行きたいと考えております。\r\n　今後とも、先生にはご迷惑なきよう誠実な技術と定期的な報告書の提出をしていきたいと思います。\r\n\r\n　何卒よろしくお願いいたします。',12,7),(29,'2026-02-25 14:45:10','2026-02-25 14:45:10','挨拶状','報告書挨拶文（ケアマネ向け）','謹啓　時下ますますご清栄のこととお喜び申し上げます。\r\n\r\n　さて、現在健康保険によるマッサージ治療を継続中の下記の方の治療経過をご報告させていただきます。\r\n\r\n　本来なら、お伺いしてご報告申し上げるところ書面にて失礼させていただきます。\r\n　もし、貴殿の方で特別なご指示がない場合は、再同意日をもって、今後も別紙に記述したような治療を継続して行うことで治療効果をあげて行きたいと考えております。\r\n　今後とも、貴殿にはご迷惑なきよう誠実な技術と定期的な報告書の提出をしていきたいと思います。\r\n\r\n　何卒よろしくお願いいたします。',12,7),(30,'2026-02-25 14:46:02','2026-02-25 14:46:02','挨拶状','報告書挨拶文（利用者向け）','謹啓　時下ますますご清栄のこととお喜び申し上げます。\r\n\r\n　さて、現在健康保険によるマッサージ治療を継続中の貴殿の治療経過をご報告させていただきます。\r\n\r\n　本来なら、お伺いしてご報告申し上げるところ書面にて失礼させていただきます。\r\n　もし、貴殿の方で特別なご指示がない場合は、再同意日をもって、今後も別紙に記述したような治療を継続して行うことで治療効果をあげて行きたいと考えております。\r\n　今後とも、貴殿にはご迷惑なきよう誠実な技術と定期的な報告書の提出をしていきたいと思います。\r\n\r\n　何卒よろしくお願いいたします。',12,7);
/*!40000 ALTER TABLE `documents` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `expenses_borne_ratios`
--

DROP TABLE IF EXISTS `expenses_borne_ratios`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `expenses_borne_ratios` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `created_at` datetime NOT NULL DEFAULT current_timestamp(),
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `expenses_borne_ratio` varchar(255) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='一部負担金の割合';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `expenses_borne_ratios`
--

LOCK TABLES `expenses_borne_ratios` WRITE;
/*!40000 ALTER TABLE `expenses_borne_ratios` DISABLE KEYS */;
INSERT INTO `expenses_borne_ratios` VALUES (1,'2025-10-15 15:13:10','2025-10-17 14:38:21','1割'),(2,'2025-10-15 15:13:11','2025-10-17 14:38:21','2割'),(3,'2025-10-15 15:13:11','2025-10-17 14:38:21','3割');
/*!40000 ALTER TABLE `expenses_borne_ratios` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `gender`
--

DROP TABLE IF EXISTS `gender`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `gender` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `created_at` datetime NOT NULL DEFAULT current_timestamp(),
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `gender` varchar(255) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='性別';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `gender`
--

LOCK TABLES `gender` WRITE;
/*!40000 ALTER TABLE `gender` DISABLE KEYS */;
INSERT INTO `gender` VALUES (1,'2025-09-08 11:51:09','2025-09-08 11:51:09','男'),(2,'2025-09-08 11:51:09','2025-09-08 11:51:09','女');
/*!40000 ALTER TABLE `gender` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `housecall_reasons`
--

DROP TABLE IF EXISTS `housecall_reasons`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `housecall_reasons` (
  `id` bigint(20) unsigned NOT NULL AUTO_INCREMENT,
  `housecall_reason` varchar(255) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `housecall_reasons`
--

LOCK TABLES `housecall_reasons` WRITE;
/*!40000 ALTER TABLE `housecall_reasons` DISABLE KEYS */;
INSERT INTO `housecall_reasons` VALUES (2,'独歩による公共交通機関を使っての外出が困難','2025-11-11 03:15:44','2025-11-11 03:15:44'),(3,'認知症や視覚･内部･精神障害などにより単独での外出が困難','2025-11-11 03:15:44','2025-11-11 03:15:44'),(4,'その他','2025-11-11 03:15:44','2025-11-11 03:15:44');
/*!40000 ALTER TABLE `housecall_reasons` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `illnesses_acupuncture`
--

DROP TABLE IF EXISTS `illnesses_acupuncture`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `illnesses_acupuncture` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `created_at` datetime NOT NULL DEFAULT current_timestamp(),
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `illness_name_acupuncture` varchar(255) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=8 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='病名（はり・きゅう）';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `illnesses_acupuncture`
--

LOCK TABLES `illnesses_acupuncture` WRITE;
/*!40000 ALTER TABLE `illnesses_acupuncture` DISABLE KEYS */;
INSERT INTO `illnesses_acupuncture` VALUES (1,'2025-09-10 11:46:28','2025-09-10 11:46:28','神経痛'),(2,'2025-09-10 11:46:28','2025-09-10 11:46:28','リマウチ'),(3,'2025-09-10 11:46:28','2025-09-10 11:46:28','頚腕症候群'),(4,'2025-09-10 11:46:28','2025-09-10 11:46:28','五十肩'),(5,'2025-09-10 11:46:28','2025-09-10 11:46:28','腰痛症'),(6,'2025-09-10 11:46:28','2025-09-10 11:46:28','頸椎捻挫後遺症'),(7,'2025-09-10 11:46:28','2025-09-10 11:46:28','その他');
/*!40000 ALTER TABLE `illnesses_acupuncture` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `illnesses_massage`
--

DROP TABLE IF EXISTS `illnesses_massage`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `illnesses_massage` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `created_at` datetime NOT NULL DEFAULT current_timestamp(),
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `illness_name` varchar(255) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=8 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='傷病名（あんま・マッサージ）';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `illnesses_massage`
--

LOCK TABLES `illnesses_massage` WRITE;
/*!40000 ALTER TABLE `illnesses_massage` DISABLE KEYS */;
INSERT INTO `illnesses_massage` VALUES (1,'2025-11-12 12:43:16','2025-11-12 12:43:16','CCCCC'),(2,'2025-11-13 13:17:44','2025-11-13 13:17:44','AAAAA'),(3,'2025-12-12 10:55:47','2025-12-12 10:55:47','リウマチ'),(4,'2025-12-17 13:42:18','2025-12-17 13:42:18','腰痛･肩こり'),(5,'2026-01-09 13:48:29','2026-01-09 13:48:29','病名テスト01'),(6,'2026-01-10 12:41:52','2026-01-10 12:41:52','肩腱板断裂'),(7,'2026-02-09 11:52:54','2026-02-09 11:52:54','関節痛');
/*!40000 ALTER TABLE `illnesses_massage` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `insurance_types_1`
--

DROP TABLE IF EXISTS `insurance_types_1`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `insurance_types_1` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `created_at` datetime NOT NULL DEFAULT current_timestamp(),
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `insurance_type_1` varchar(255) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='保険種別１';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `insurance_types_1`
--

LOCK TABLES `insurance_types_1` WRITE;
/*!40000 ALTER TABLE `insurance_types_1` DISABLE KEYS */;
INSERT INTO `insurance_types_1` VALUES (1,'2025-10-15 15:10:32','2025-11-01 12:40:54','社･国･組'),(2,'2025-10-15 15:10:33','2025-10-15 15:10:33','公費'),(3,'2025-10-15 15:10:33','2025-10-15 15:10:33','後期'),(4,'2025-10-15 15:10:33','2025-10-15 15:10:33','退職');
/*!40000 ALTER TABLE `insurance_types_1` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `insurance_types_2`
--

DROP TABLE IF EXISTS `insurance_types_2`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `insurance_types_2` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `created_at` datetime NOT NULL DEFAULT current_timestamp(),
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `insurance_type_2` varchar(255) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='保険種別２';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `insurance_types_2`
--

LOCK TABLES `insurance_types_2` WRITE;
/*!40000 ALTER TABLE `insurance_types_2` DISABLE KEYS */;
INSERT INTO `insurance_types_2` VALUES (1,'2025-10-15 15:11:06','2025-10-15 15:11:06','単独'),(2,'2025-10-15 15:11:06','2025-10-15 15:11:06','２併'),(3,'2025-10-15 15:11:06','2025-10-15 15:11:06','３併');
/*!40000 ALTER TABLE `insurance_types_2` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `insurance_types_3`
--

DROP TABLE IF EXISTS `insurance_types_3`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `insurance_types_3` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `created_at` datetime NOT NULL DEFAULT current_timestamp(),
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `insurance_type_3` varchar(255) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='保険種別３';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `insurance_types_3`
--

LOCK TABLES `insurance_types_3` WRITE;
/*!40000 ALTER TABLE `insurance_types_3` DISABLE KEYS */;
INSERT INTO `insurance_types_3` VALUES (1,'2025-10-15 15:12:28','2025-10-15 15:12:28','本外'),(2,'2025-10-15 15:12:28','2025-10-15 15:12:28','三外'),(3,'2025-10-15 15:12:28','2025-10-15 15:12:28','家外'),(4,'2025-10-15 15:12:28','2025-10-15 15:12:28','高外９'),(5,'2025-10-15 15:12:29','2025-10-15 15:12:29','高外８');
/*!40000 ALTER TABLE `insurance_types_3` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `insurances`
--

DROP TABLE IF EXISTS `insurances`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `insurances` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `created_at` datetime NOT NULL DEFAULT current_timestamp(),
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `clinic_user_id` int(11) NOT NULL,
  `insurance_type_1_id` int(11) DEFAULT NULL,
  `insurance_type_2_id` int(11) DEFAULT NULL,
  `insurance_type_3_id` int(11) DEFAULT NULL,
  `self_or_family_id` int(11) DEFAULT NULL,
  `insured_number` bigint(20) DEFAULT NULL,
  `code_number` bigint(20) DEFAULT NULL,
  `account_number` bigint(20) DEFAULT NULL,
  `locality_code` bigint(20) DEFAULT NULL,
  `recipient_code` bigint(20) DEFAULT NULL,
  `license_acquisition_date` date NOT NULL,
  `certification_date` date DEFAULT NULL,
  `issue_date` date DEFAULT NULL,
  `expenses_borne_ratio_id` int(1) DEFAULT NULL,
  `expiry_date` date DEFAULT NULL,
  `is_redeemed` tinyint(1) DEFAULT NULL,
  `insured_name` varchar(255) DEFAULT NULL,
  `relationship_with_clinic_user_id` int(11) DEFAULT NULL,
  `is_healthcare_subsidized` tinyint(1) DEFAULT NULL,
  `public_funds_payer_code` bigint(20) DEFAULT NULL,
  `public_funds_recipient_code` bigint(20) DEFAULT NULL,
  `locality_code_family` bigint(20) DEFAULT NULL,
  `recipient_code_family` bigint(20) DEFAULT NULL,
  `insurers_id` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `insurances_insurance_types_3_FK` (`insurance_type_3_id`),
  KEY `insurances_insurance_types_1_FK` (`insurance_type_1_id`),
  KEY `insurances_insurance_types_2_FK` (`insurance_type_2_id`),
  KEY `insurances_self_or_family_FK` (`self_or_family_id`),
  KEY `insurances_expenses_borne_ratios_FK` (`expenses_borne_ratio_id`),
  KEY `insurances_relationships_with_clinic_user_FK` (`relationship_with_clinic_user_id`),
  KEY `insurances_insurers_FK` (`insurers_id`),
  KEY `insurances_clinic_user_id_foreign` (`clinic_user_id`),
  CONSTRAINT `insurances_clinic_user_id_foreign` FOREIGN KEY (`clinic_user_id`) REFERENCES `clinic_users` (`id`),
  CONSTRAINT `insurances_expenses_borne_ratios_FK` FOREIGN KEY (`expenses_borne_ratio_id`) REFERENCES `expenses_borne_ratios` (`id`),
  CONSTRAINT `insurances_insurance_types_1_FK` FOREIGN KEY (`insurance_type_1_id`) REFERENCES `insurance_types_1` (`id`),
  CONSTRAINT `insurances_insurance_types_2_FK` FOREIGN KEY (`insurance_type_2_id`) REFERENCES `insurance_types_2` (`id`),
  CONSTRAINT `insurances_insurance_types_3_FK` FOREIGN KEY (`insurance_type_3_id`) REFERENCES `insurance_types_3` (`id`),
  CONSTRAINT `insurances_insurers_FK` FOREIGN KEY (`insurers_id`) REFERENCES `insurers` (`id`),
  CONSTRAINT `insurances_relationships_with_clinic_user_FK` FOREIGN KEY (`relationship_with_clinic_user_id`) REFERENCES `relationships_with_clinic_user` (`id`),
  CONSTRAINT `insurances_self_or_family_FK` FOREIGN KEY (`self_or_family_id`) REFERENCES `self_or_family` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=29 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='保険情報';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `insurances`
--

LOCK TABLES `insurances` WRITE;
/*!40000 ALTER TABLE `insurances` DISABLE KEYS */;
INSERT INTO `insurances` VALUES (23,'2025-11-28 13:54:34','2026-02-24 14:58:33',306,1,1,1,1,2468,NULL,NULL,NULL,NULL,'2025-11-28',NULL,NULL,2,NULL,0,NULL,NULL,0,NULL,NULL,NULL,NULL,22),(24,'2025-11-29 15:08:52','2026-02-24 14:58:34',298,1,1,1,1,20406080,20406080,20406080,20406080,20406080,'2025-11-29','2025-11-02','2025-11-02',2,'2025-11-02',1,'飛歩賢者',2,1,20406080,20406080,20406080,20406080,26),(25,'2025-12-11 11:26:43','2026-02-24 15:03:48',241,1,1,1,1,204060,204060,204060,204060,204060,'2025-05-15',NULL,NULL,NULL,NULL,0,NULL,NULL,0,NULL,NULL,NULL,NULL,24),(26,'2025-12-11 11:29:51','2026-02-24 15:03:33',241,1,1,1,1,204060,NULL,NULL,NULL,NULL,'2026-01-20',NULL,NULL,NULL,NULL,0,NULL,NULL,0,NULL,NULL,NULL,NULL,25),(27,'2025-12-16 15:05:14','2026-02-27 10:57:08',157,3,1,1,1,2468246,24682,12345,131032,246824,'2025-12-10','2025-12-10','2025-12-10',3,'2026-05-20',1,'山口和希',2,1,24682468,2468246,131045,135791,27),(28,'2026-01-09 13:43:19','2026-01-09 13:43:19',214,1,1,1,1,111111,222222,333333,444444,555555,'2026-01-02','2026-01-02','2026-01-02',3,'2026-01-02',0,'青木俊介',2,0,NULL,NULL,666666,777777,28);
/*!40000 ALTER TABLE `insurances` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `insurers`
--

DROP TABLE IF EXISTS `insurers`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `insurers` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `created_at` datetime NOT NULL DEFAULT current_timestamp(),
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `insurer_name` varchar(255) DEFAULT NULL,
  `insurer_number` int(11) DEFAULT NULL,
  `postal_code` varchar(255) DEFAULT NULL,
  `address` varchar(255) DEFAULT NULL,
  `recipient_name` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=29 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='保険者';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `insurers`
--

LOCK TABLES `insurers` WRITE;
/*!40000 ALTER TABLE `insurers` DISABLE KEYS */;
INSERT INTO `insurers` VALUES (11,'2025-10-21 12:57:24','2026-02-24 14:34:03','AAA保険',111111,NULL,'aaaaa','aaaaa'),(12,'2025-10-21 12:58:10','2026-02-24 14:34:03','BBB保険',22222222,NULL,'BBBBB','BBBBB'),(13,'2025-10-21 12:58:51','2026-02-24 14:34:54','CCC保険',333333,NULL,NULL,NULL),(14,'2025-10-24 15:23:05','2026-02-24 14:34:54','DDD保険',666666,NULL,NULL,NULL),(15,'2025-10-24 15:36:16','2026-02-24 14:34:54','EEE保険',666666,NULL,NULL,NULL),(16,'2025-10-24 15:37:56','2026-02-24 14:34:54','FFF保険',666666,NULL,NULL,NULL),(17,'2025-10-29 10:23:53','2026-02-24 14:34:54','GGG保険',123456,NULL,'ABCDE','ABCDE'),(18,'2025-10-31 14:55:37','2026-02-24 14:34:54','HHH保険',0,NULL,'XXXXX','XXXXX'),(19,'2025-10-31 15:31:24','2026-02-24 14:34:54','JJJ保険',55555555,'555-5555','AAAAA','AAAAA'),(20,'2025-11-01 12:09:35','2026-02-24 14:34:54','KKK保険',0,'111-1111','BBBBB','BBBBB'),(21,'2025-11-01 12:12:47','2026-02-24 14:34:54','LLL保険',111111,NULL,NULL,NULL),(22,'2025-11-28 13:54:34','2026-02-24 14:34:54','MMM保険',111111,NULL,NULL,NULL),(23,'2025-11-29 15:08:52','2026-02-24 14:34:54','NNN保険',20406080,'880-0002','宮崎県宮崎市中央通','AAAAA'),(24,'2025-12-11 11:26:43','2026-02-24 14:34:54','PPP保険',204060,NULL,NULL,NULL),(25,'2025-12-11 11:29:51','2026-02-24 14:34:54','QQQ保険',204060,'204-0600','204060','204060'),(26,'2025-12-16 15:03:11','2025-12-16 15:03:11','スカーレット保険',246824,'880-0002','宮崎県宮崎市中央通','スカーレット保険事務局'),(27,'2025-12-16 15:05:14','2025-12-16 15:05:14','スカーレット保険',246824,'880-0002','宮崎県宮崎市中央通','スカーレット保険事務局'),(28,'2026-01-09 13:43:19','2026-01-09 13:43:19','カリブ中央保険',888888,'100-0002','東京都千代田区皇居外苑','カリブ中央保険第二ビル');
/*!40000 ALTER TABLE `insurers` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `license`
--

DROP TABLE IF EXISTS `license`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `license` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `created_at` datetime NOT NULL DEFAULT current_timestamp(),
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `license` varchar(255) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='資格種類';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `license`
--

LOCK TABLES `license` WRITE;
/*!40000 ALTER TABLE `license` DISABLE KEYS */;
INSERT INTO `license` VALUES (1,'2025-09-08 11:27:17','2025-09-08 11:27:17','はり師'),(2,'2025-09-08 11:27:17','2025-09-08 11:27:17','きゅう師'),(3,'2025-09-08 11:27:17','2025-09-08 11:27:17','あんま・マッサージ師');
/*!40000 ALTER TABLE `license` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `medical_institutions`
--

DROP TABLE IF EXISTS `medical_institutions`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `medical_institutions` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `created_at` datetime NOT NULL DEFAULT current_timestamp(),
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `medical_institution_name` varchar(255) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='医療機関名';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `medical_institutions`
--

LOCK TABLES `medical_institutions` WRITE;
/*!40000 ALTER TABLE `medical_institutions` DISABLE KEYS */;
INSERT INTO `medical_institutions` VALUES (1,'2025-11-06 14:21:06','2025-11-06 14:21:06','AAAAA'),(2,'2025-11-06 15:09:49','2025-11-06 15:09:49','CCCCC'),(3,'2025-11-07 13:04:46','2025-11-07 13:04:46','DDDDD'),(4,'2025-11-14 12:33:12','2025-11-14 12:33:12','BBBBB'),(5,'2025-12-12 10:28:05','2025-12-12 10:28:05','ユーラシア中央病院'),(6,'2026-02-14 12:47:56','2026-02-14 12:47:56','アジア中央病院');
/*!40000 ALTER TABLE `medical_institutions` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `migrations`
--

DROP TABLE IF EXISTS `migrations`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `migrations` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `migration` varchar(255) NOT NULL,
  `batch` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=47 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `migrations`
--

LOCK TABLES `migrations` WRITE;
/*!40000 ALTER TABLE `migrations` DISABLE KEYS */;
INSERT INTO `migrations` VALUES (1,'2025_10_09_153328_rename_concenting_tables_to_consenting',1),(2,'2025_10_09_153935_rename_concenting_tables_to_consenting_v2',2),(3,'2025_11_11_121503_create_house_visit_reasons_table',3),(4,'2025_11_12_121217_rename_house_visit_reasons_to_housecall_reasons',4),(5,'2025_11_13_110509_create_plan_infos_table',5),(6,'2025_11_14_105352_rename_billing_prefecture_id_to_billing_prefecture_in_clinic_info_table',6),(7,'0001_01_01_000000_create_users_table',7),(8,'0001_01_01_000001_create_cache_table',7),(9,'0001_01_01_000002_create_jobs_table',7),(10,'2025_11_17_151942_add_columns_to_document_templates_table',8),(11,'2025_11_18_110145_change_documents_content_to_text',9),(12,'2025_11_11_121503_create_housecall_reasons_table',5),(13,'2025_11_18_111128_change_documents_name_to_varchar',10),(19,'2025_11_18_140329_change_clinic_info_columns_to_varchar',11),(20,'2025_11_19_112642_create_self_paid_fees_table',12),(21,'2025_11_20_103519_fix_document_association_foreign_keys',12),(22,'2025_11_20_104322_rename_document_association_columns',13),(23,'2025_11_21_130944_add_last_login_at_to_system_users_table',14),(24,'2025_11_21_140341_add_clinic_user_id_to_records_table',15),(25,'2025_11_28_105101_rename_consents_massage_bodyparts_table',16),(26,'2025_11_28_112410_rename_consenting_doctor_history_massage_id_column_in_bodyparts_consents_massage_table',17),(27,'2025_12_08_152118_modify_therapists_name_fields',18),(28,'2025_12_08_152238_update_doctors_table_split_name_to_first_last',19),(29,'2025_12_08_152412_modify_caremanagers_name_fields',19),(30,'2025_12_11_150230_add_therapy_period_dates_to_consent_tables',20),(31,'2025_12_12_151309_add_columns_to_deposits_table',21),(32,'2025_12_16_150407_change_insurance_number_columns_to_bigint_in_insurances_table',22),(33,'2025_12_17_135648_add_housecall_reason_columns_to_consents_acupuncture_table',23),(35,'2026_01_08_113432_add_therapy_type_to_therapy_contents_table',24),(36,'2026_01_08_113502_update_therapy_contents_data',24),(37,'2026_01_09_142907_rename_therapy_conetnt_id_to_therapy_content_id_in_records_table',25),(38,'2026_01_17_151011_add_self_fee_id_to_records_table',26),(39,'2026_01_20_105254_split_owner_name_in_clinic_info_table',27),(40,'2026_01_30_145709_drop_foreign_keys_from_therapists_table',28),(41,'2026_01_30_145938_drop_license_number_fields_from_therapists_table',29),(42,'2026_01_30_150511_rename_license_id_to_code_number_in_therapists_table',30),(43,'2026_01_30_152007_change_license_code_number_to_bigint_in_therapists_table',31);
/*!40000 ALTER TABLE `migrations` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `outcomes`
--

DROP TABLE IF EXISTS `outcomes`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `outcomes` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `created_at` datetime NOT NULL DEFAULT current_timestamp(),
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `outcome` varchar(255) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='転帰';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `outcomes`
--

LOCK TABLES `outcomes` WRITE;
/*!40000 ALTER TABLE `outcomes` DISABLE KEYS */;
INSERT INTO `outcomes` VALUES (1,'2025-09-10 12:00:41','2025-09-10 12:00:41','継続'),(2,'2025-09-10 12:00:42','2025-09-10 12:00:42','治癒'),(3,'2025-09-10 12:00:42','2025-09-10 12:00:42','中止'),(4,'2025-09-10 12:00:42','2025-09-10 12:00:42','転医');
/*!40000 ALTER TABLE `outcomes` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `password_reset_tokens`
--

DROP TABLE IF EXISTS `password_reset_tokens`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `password_reset_tokens` (
  `email` varchar(255) NOT NULL,
  `token` varchar(255) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`email`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `password_reset_tokens`
--

LOCK TABLES `password_reset_tokens` WRITE;
/*!40000 ALTER TABLE `password_reset_tokens` DISABLE KEYS */;
/*!40000 ALTER TABLE `password_reset_tokens` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `plans`
--

DROP TABLE IF EXISTS `plans`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `plans` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `created_at` datetime NOT NULL DEFAULT current_timestamp(),
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `clinic_user_id` int(11) NOT NULL,
  `assessment_date` date NOT NULL,
  `assessor` varchar(255) DEFAULT NULL,
  `audience` varchar(255) DEFAULT NULL,
  `eating_assistance_level_id` int(11) DEFAULT NULL,
  `eating_assistance_note` varchar(255) DEFAULT NULL,
  `moving_assistance_level_id` int(11) DEFAULT NULL,
  `moving_assistance_note` varchar(255) DEFAULT NULL,
  `personal_grooming_assistance_level_id` int(11) DEFAULT NULL,
  `personal_grooming_assistance_note` varchar(255) DEFAULT NULL,
  `using_toilet_assistance_level_id` int(11) DEFAULT NULL,
  `using_toilet_assistance_note` varchar(255) DEFAULT NULL,
  `bathing_assistance_level_id` int(11) DEFAULT NULL,
  `bathing_assistance_note` varchar(255) DEFAULT NULL,
  `walking_assistance_level_id` int(11) DEFAULT NULL,
  `walking_assistance_note` varchar(255) DEFAULT NULL,
  `using_stairs_assistance_level_id` int(11) DEFAULT NULL,
  `using_stairs_assistance_note` varchar(255) DEFAULT NULL,
  `changing_clothes_assistance_level_id` int(11) DEFAULT NULL,
  `changing_clothes_assistance_note` varchar(255) DEFAULT NULL,
  `defecation_assistance_level_id` int(11) DEFAULT NULL,
  `defecation_assistance_note` varchar(255) DEFAULT NULL,
  `urination_assistance_level_id` int(11) DEFAULT NULL,
  `urination_assistance_note` varchar(255) DEFAULT NULL,
  `communication_note` varchar(255) DEFAULT NULL,
  `wish_of_user_and_familiy` varchar(255) DEFAULT NULL,
  `care_purpose` varchar(255) DEFAULT NULL,
  `rehabilitation_program` varchar(255) DEFAULT NULL,
  `home_rehabilitation` varchar(255) DEFAULT NULL,
  `change_since_previous_planning` varchar(255) DEFAULT NULL,
  `note` varchar(255) DEFAULT NULL,
  `user_and_family_consent_date` date DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `plan_documents_assistance_levels_FK` (`eating_assistance_level_id`),
  KEY `plan_documents_assistance_levels_FK_1` (`moving_assistance_level_id`),
  KEY `plan_documents_assistance_levels_FK_2` (`personal_grooming_assistance_level_id`),
  KEY `plan_documents_assistance_levels_FK_3` (`using_toilet_assistance_level_id`),
  KEY `plan_documents_assistance_levels_FK_4` (`bathing_assistance_level_id`),
  KEY `plan_documents_assistance_levels_FK_5` (`walking_assistance_level_id`),
  KEY `plan_documents_assistance_levels_FK_6` (`using_stairs_assistance_level_id`),
  KEY `plan_documents_assistance_levels_FK_7` (`changing_clothes_assistance_level_id`),
  KEY `plan_documents_assistance_levels_FK_8` (`defecation_assistance_level_id`),
  KEY `plan_documents_assistance_levels_FK_9` (`urination_assistance_level_id`),
  KEY `idx_clinic_user_id` (`clinic_user_id`),
  CONSTRAINT `fk_plans_clinic_user_id` FOREIGN KEY (`clinic_user_id`) REFERENCES `clinic_users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  CONSTRAINT `plan_documents_assistance_levels_FK` FOREIGN KEY (`eating_assistance_level_id`) REFERENCES `assistance_levels` (`id`),
  CONSTRAINT `plan_documents_assistance_levels_FK_1` FOREIGN KEY (`moving_assistance_level_id`) REFERENCES `assistance_levels` (`id`),
  CONSTRAINT `plan_documents_assistance_levels_FK_2` FOREIGN KEY (`personal_grooming_assistance_level_id`) REFERENCES `assistance_levels` (`id`),
  CONSTRAINT `plan_documents_assistance_levels_FK_3` FOREIGN KEY (`using_toilet_assistance_level_id`) REFERENCES `assistance_levels` (`id`),
  CONSTRAINT `plan_documents_assistance_levels_FK_4` FOREIGN KEY (`bathing_assistance_level_id`) REFERENCES `assistance_levels` (`id`),
  CONSTRAINT `plan_documents_assistance_levels_FK_5` FOREIGN KEY (`walking_assistance_level_id`) REFERENCES `assistance_levels` (`id`),
  CONSTRAINT `plan_documents_assistance_levels_FK_6` FOREIGN KEY (`using_stairs_assistance_level_id`) REFERENCES `assistance_levels` (`id`),
  CONSTRAINT `plan_documents_assistance_levels_FK_7` FOREIGN KEY (`changing_clothes_assistance_level_id`) REFERENCES `assistance_levels` (`id`),
  CONSTRAINT `plan_documents_assistance_levels_FK_8` FOREIGN KEY (`defecation_assistance_level_id`) REFERENCES `assistance_levels` (`id`),
  CONSTRAINT `plan_documents_assistance_levels_FK_9` FOREIGN KEY (`urination_assistance_level_id`) REFERENCES `assistance_levels` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='計画情報';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `plans`
--

LOCK TABLES `plans` WRITE;
/*!40000 ALTER TABLE `plans` DISABLE KEYS */;
INSERT INTO `plans` VALUES (4,'2026-02-25 11:20:15','2026-02-25 11:20:15',298,'2026-02-05','評価者０１','聴衆者０１',3,NULL,2,NULL,8,NULL,2,NULL,1,NULL,7,NULL,8,NULL,8,NULL,8,NULL,1,NULL,'計画情報０１','計画情報０１計画情報０１','計画情報０１計画情報０１計画情報０１','計画情報０１計画情報０１計画情報０１計画情報０１','計画情報０１計画情報０１計画情報０１計画情報０１計画情報０１','計画情報０１計画情報０１計画情報０１計画情報０１計画情報０１計画情報０１','計画情報０１計画情報０１計画情報０１計画情報０１計画情報０１計画情報０１計画情報０１','2026-02-10'),(5,'2026-02-25 11:36:48','2026-02-25 11:36:48',298,'2026-01-02','評価者０２','聴衆者０２',2,'備考A',2,'備考B',8,'備考C',2,'備考D',8,'備考E',5,'備考F',8,'備考G',5,'備考H',2,'備考I',2,'備考J','計画情報０２計画情報０２計画情報０２計画情報０２計画情報０２計画情報０２計画情報０２','計画情報０２計画情報０２計画情報０２計画情報０２計画情報０２計画情報０２','計画情報０２計画情報０２計画情報０２計画情報０２計画情報０２','計画情報０２計画情報０２計画情報０２計画情報０２','計画情報０２計画情報０２計画情報０２','計画情報０２計画情報０２','計画情報０２','2026-01-01'),(6,'2026-02-25 15:08:47','2026-02-25 15:08:47',241,'2026-02-15','テスト','テスト',2,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'テスト',NULL,NULL,NULL,NULL,NULL,NULL,'2026-02-25');
/*!40000 ALTER TABLE `plans` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `records`
--

DROP TABLE IF EXISTS `records`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `records` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `created_at` datetime NOT NULL DEFAULT current_timestamp(),
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `clinic_user_id` int(11) DEFAULT NULL,
  `date` date NOT NULL,
  `start_time` time DEFAULT NULL,
  `end_time` time DEFAULT NULL,
  `therapy_type` varchar(255) NOT NULL,
  `therapy_category` varchar(255) DEFAULT NULL,
  `insurance_category` varchar(255) DEFAULT NULL,
  `housecall_distance` int(11) DEFAULT NULL,
  `therapy_days` int(11) DEFAULT NULL,
  `consent_expiry` date DEFAULT NULL,
  `therapy_content_id` int(11) DEFAULT NULL,
  `self_fee_id` int(11) DEFAULT NULL,
  `bill_category_id` int(11) DEFAULT NULL,
  `therapist_id` int(11) DEFAULT NULL,
  `abstract` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `records_therapists_FK` (`therapist_id`),
  KEY `records_therapy_conetnt_FK` (`therapy_content_id`),
  KEY `records_bill_categories_FK` (`bill_category_id`),
  KEY `records_clinic_user_id_foreign` (`clinic_user_id`),
  CONSTRAINT `records_bill_categories_FK` FOREIGN KEY (`bill_category_id`) REFERENCES `bill_categories` (`id`),
  CONSTRAINT `records_clinic_user_id_foreign` FOREIGN KEY (`clinic_user_id`) REFERENCES `clinic_users` (`id`) ON DELETE CASCADE,
  CONSTRAINT `records_therapists_FK` FOREIGN KEY (`therapist_id`) REFERENCES `therapists` (`id`),
  CONSTRAINT `records_therapy_conetnt_FK` FOREIGN KEY (`therapy_content_id`) REFERENCES `therapy_contents` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=120 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='実績データ';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `records`
--

LOCK TABLES `records` WRITE;
/*!40000 ALTER TABLE `records` DISABLE KEYS */;
INSERT INTO `records` VALUES (49,'2025-12-09 11:36:42','2026-02-12 11:04:44',298,'2025-12-01','11:00:00','12:10:00','1','1','24',NULL,2,'2025-12-20',11,NULL,2,1,'・Lorem ipsum dolor sit amet, consectetur adipiscing elit.\r\n・Lorem ipsum dolor sit amet, consectetur adipiscing elit.Lorem ipsum dolor sit amet, consectetur adipiscing elit.'),(50,'2025-12-09 11:36:42','2026-02-12 11:04:44',298,'2025-12-18','11:00:00','12:10:00','1','1','24',NULL,2,'2025-12-20',15,NULL,2,1,'・Lorem ipsum dolor sit amet, consectetur adipiscing elit.\r\n・Lorem ipsum dolor sit amet, consectetur adipiscing elit.Lorem ipsum dolor sit amet, consectetur adipiscing elit.'),(51,'2025-12-09 11:47:46','2026-02-12 11:04:44',298,'2025-12-04','13:00:00','14:10:00','2','2','24',2,3,'2025-12-01',20,NULL,1,1,'Lorem ipsum dolor sit amet, consectetur adipiscing elit.'),(52,'2025-12-09 11:47:46','2026-02-12 13:15:20',298,'2025-12-12','13:00:00','14:10:00','2','2','24',6,3,'2025-12-01',20,NULL,2,1,'Lorem ipsum dolor sit amet, consectetur adipiscing elit.'),(53,'2025-12-09 11:47:46','2026-02-12 13:15:20',298,'2025-12-20','13:00:00','14:10:00','2','2','24',12,3,'2025-12-01',19,NULL,2,1,'Lorem ipsum dolor sit amet, consectetur adipiscing elit.'),(54,'2025-12-09 15:41:02','2026-02-12 11:04:44',298,'2025-06-04','12:30:00','23:00:00','1','2','24',7,1,'2025-12-20',12,NULL,2,2,NULL),(55,'2025-12-09 15:42:37','2026-02-12 13:16:12',298,'2025-12-04','17:00:00','18:10:00','2','2','24',5,10,'2025-12-01',21,NULL,2,1,'Lorem ipsum dolor sit amet, consectetur adipiscing elit.'),(56,'2025-12-09 15:42:37','2026-02-12 13:15:20',298,'2025-12-06','17:00:00','18:10:00','2','2','24',5,10,'2025-12-01',21,NULL,2,1,'Lorem ipsum dolor sit amet, consectetur adipiscing elit.'),(57,'2025-12-09 15:42:37','2026-02-12 13:15:20',298,'2025-12-08','17:00:00','18:10:00','2','2','24',5,10,'2025-12-01',19,NULL,2,1,'Lorem ipsum dolor sit amet, consectetur adipiscing elit.'),(58,'2025-12-09 15:42:37','2026-02-12 13:15:20',298,'2025-12-12','17:00:00','18:10:00','2','2','24',5,10,'2025-12-01',20,NULL,2,1,'Lorem ipsum dolor sit amet, consectetur adipiscing elit.'),(59,'2025-12-09 15:42:37','2026-02-12 13:15:20',298,'2025-12-15','17:00:00','18:10:00','2','2','24',5,10,'2025-12-01',21,NULL,2,1,'Lorem ipsum dolor sit amet, consectetur adipiscing elit.'),(60,'2025-12-09 15:42:37','2026-02-12 13:15:20',298,'2025-12-18','17:00:00','18:10:00','2','2','24',5,10,'2025-12-01',20,NULL,2,1,'Lorem ipsum dolor sit amet, consectetur adipiscing elit.'),(61,'2025-12-09 15:42:37','2026-02-12 13:15:20',298,'2025-12-20','17:00:00','18:10:00','2','2','24',5,10,'2025-12-01',19,NULL,2,1,'Lorem ipsum dolor sit amet, consectetur adipiscing elit.'),(62,'2025-12-09 15:42:37','2026-02-12 13:15:20',298,'2025-12-25','17:00:00','18:10:00','2','2','24',5,10,'2025-12-01',20,NULL,2,1,'Lorem ipsum dolor sit amet, consectetur adipiscing elit.'),(63,'2025-12-09 15:42:37','2026-02-12 13:15:20',298,'2025-12-27','17:00:00','18:10:00','2','2','24',5,10,'2025-12-01',20,NULL,2,1,'Lorem ipsum dolor sit amet, consectetur adipiscing elit.'),(64,'2025-12-09 15:42:37','2026-02-12 13:15:20',298,'2025-12-29','17:00:00','18:10:00','2','2','24',5,10,'2025-12-01',18,NULL,2,1,'Lorem ipsum dolor sit amet, consectetur adipiscing elit.'),(65,'2025-12-09 15:44:48','2026-02-12 11:04:44',298,'2025-08-13','13:30:00','22:00:00','1','2','24',9,1,'2025-12-20',13,NULL,2,3,NULL),(66,'2025-12-11 10:39:49','2026-02-12 11:04:44',298,'2025-12-13','08:50:00','10:00:00','1','1','24',NULL,1,'2025-12-20',16,NULL,2,1,NULL),(67,'2025-12-11 10:43:11','2026-02-12 11:04:44',298,'2025-12-10','09:50:00','14:00:00','1','1','24',NULL,1,'2025-12-20',11,NULL,2,2,NULL),(68,'2025-12-11 10:48:25','2026-02-12 11:04:44',298,'2025-12-11','10:30:00','13:00:00','1','2','24',8,1,'2025-12-20',13,NULL,2,2,NULL),(69,'2025-12-11 10:56:39','2026-02-12 11:04:44',298,'2025-12-08','11:30:00','16:00:00','1','2','24',9,1,'2025-12-20',16,NULL,2,2,NULL),(73,'2025-12-13 13:42:20','2026-02-12 11:04:44',298,'2024-06-05','10:20:00','13:40:00','1','1','24',NULL,2,NULL,15,NULL,2,1,NULL),(74,'2025-12-13 13:42:20','2026-02-12 11:04:44',298,'2024-06-10','10:20:00','13:40:00','1','1','24',NULL,2,NULL,11,NULL,2,1,NULL),(75,'2025-12-13 13:43:14','2026-02-12 11:04:44',298,'2022-10-12','10:40:00','17:10:00','2','1','24',NULL,1,'2025-12-01',19,NULL,2,1,NULL),(76,'2025-12-13 13:43:48','2026-02-12 11:04:44',298,'2022-04-21','11:00:00','12:00:00','1','1','24',NULL,5,NULL,13,NULL,2,2,NULL),(77,'2025-12-13 13:43:48','2026-02-12 11:04:44',298,'2022-04-22','11:00:00','12:00:00','1','1','24',NULL,5,NULL,11,NULL,2,2,NULL),(78,'2025-12-13 13:43:48','2026-02-12 11:04:44',298,'2022-04-25','11:00:00','12:00:00','1','1','24',NULL,5,NULL,15,NULL,2,2,NULL),(79,'2025-12-13 13:43:48','2026-02-12 11:04:44',298,'2022-04-27','11:00:00','12:00:00','1','1','24',NULL,5,NULL,12,NULL,2,2,NULL),(80,'2025-12-13 13:43:48','2026-02-12 11:04:44',298,'2022-04-29','11:00:00','12:00:00','1','1','24',NULL,5,NULL,15,NULL,2,2,NULL),(81,'2025-12-15 10:47:08','2026-02-12 11:04:44',241,'2025-12-10','10:10:00','19:50:00','1','1','25',NULL,1,NULL,13,NULL,1,2,NULL),(88,'2026-01-08 11:48:10','2026-01-08 11:48:10',298,'2026-01-10','10:00:00','15:00:00','1','1','24',NULL,1,'2025-12-10',15,NULL,2,2,'摘要テスト４、摘要テスト４。'),(89,'2026-01-08 10:34:15','2026-01-09 11:48:04',298,'2026-01-02','10:00:00','11:00:00','1','1','24',NULL,1,'2025-12-10',11,NULL,2,1,'摘要テスト３、摘要テスト３。'),(90,'2026-01-08 10:33:06','2026-01-09 11:48:12',298,'2026-01-22','11:00:00','14:00:00','1','1','24',NULL,1,'2025-12-10',12,NULL,2,1,'摘要テスト１、摘要テスト１。'),(91,'2026-01-07 11:50:36','2026-01-09 11:48:31',298,'2026-01-05','10:00:00','13:00:00','2','2','24',7,2,NULL,18,NULL,2,3,NULL),(92,'2026-01-07 11:50:36','2026-01-09 11:48:31',298,'2026-01-14','10:00:00','13:00:00','2','2','24',7,2,NULL,18,NULL,2,3,NULL),(93,'2026-01-09 11:49:03','2026-01-09 11:49:03',298,'2026-01-12','10:30:00','15:20:00','1','1','24',NULL,2,'2025-12-10',13,NULL,2,1,NULL),(94,'2026-01-09 11:49:03','2026-01-09 11:49:03',298,'2026-01-19','10:30:00','15:20:00','1','1','24',NULL,2,'2025-12-10',13,NULL,2,1,NULL),(95,'2026-01-09 11:53:00','2026-01-09 11:53:00',298,'2026-01-29','12:00:00','13:00:00','1','2','24',12,3,'2025-12-10',11,NULL,2,1,NULL),(96,'2026-01-09 11:53:00','2026-01-09 11:53:00',298,'2026-01-30','12:00:00','13:00:00','1','2','24',12,3,'2025-12-10',11,NULL,2,1,NULL),(97,'2026-01-09 11:53:00','2026-01-09 11:53:00',298,'2026-01-31','12:00:00','13:00:00','1','2','24',12,3,'2025-12-10',11,NULL,2,1,NULL),(99,'2026-01-09 13:55:06','2026-01-09 13:55:06',214,'2026-01-02','06:00:00','20:00:00','1','1','28',NULL,1,'2026-01-03',14,NULL,2,1,NULL),(100,'2026-01-09 13:55:26','2026-01-09 13:55:26',214,'2026-01-03','06:00:00','19:00:00','1','1','28',NULL,1,'2026-01-03',16,NULL,2,1,NULL),(101,'2026-01-09 13:56:00','2026-01-09 13:56:00',214,'2026-01-05','06:00:00','18:00:00','1','1','28',NULL,1,'2026-01-03',12,NULL,2,1,NULL),(102,'2026-01-10 12:48:00','2026-01-10 12:48:00',298,'2026-01-07','06:00:00','19:00:00','2','2','24',22,1,'2026-01-03',18,NULL,2,1,'マッサージ摘要０１'),(103,'2026-01-16 11:27:27','2026-01-16 11:27:27',298,'2026-01-26','09:00:00','14:00:00','2','2','24',1,1,'2026-01-03',19,NULL,2,1,NULL),(104,'2026-01-17 15:11:43','2026-01-17 15:11:43',298,'2026-01-24','07:00:00','10:00:00','1','1',NULL,NULL,1,'2025-12-10',NULL,2,2,1,'実績（自費施術）の摘要'),(105,'2026-01-20 10:35:36','2026-01-20 10:35:36',298,'2026-01-01','07:00:00','13:00:00','1','2',NULL,9,1,'2025-12-10',NULL,1,2,1,NULL),(106,'2026-02-04 15:48:58','2026-02-04 15:48:58',298,'2026-02-25','09:00:00','15:00:00','1','1','24',NULL,1,'2025-12-10',11,NULL,2,1,NULL),(109,'2026-02-04 15:58:24','2026-02-04 15:58:24',298,'2026-04-01','08:00:00','15:00:00','1','1','24',NULL,1,'2025-12-10',11,NULL,1,1,NULL),(110,'2026-02-10 10:26:01','2026-02-10 10:26:01',298,'2026-01-07','06:00:00','18:00:00','2','2','24',6,1,'2026-01-03',19,NULL,2,1,'マッサージ摘要０１'),(111,'2026-02-10 10:28:36','2026-02-10 10:28:36',298,'2026-02-07','07:00:00','16:00:00','2','1','24',NULL,1,'2026-01-03',19,NULL,2,1,'変形徒手矯正術摘要０１'),(112,'2026-02-10 10:30:02','2026-02-10 10:30:02',298,'2026-02-27','09:00:00','16:00:00','2','2','24',7,1,'2026-01-03',18,NULL,2,1,'マッサージ摘要０２'),(113,'2026-02-10 10:31:26','2026-02-10 10:31:26',298,'2026-02-28','08:00:00','16:00:00','2','2','24',2,1,'2026-01-03',19,NULL,2,1,'変形徒手矯正術摘要０２'),(114,'2026-02-10 10:40:19','2026-02-10 10:40:19',298,'2026-02-16','06:00:00','18:00:00','2','1','24',NULL,1,'2026-01-03',20,NULL,2,1,NULL),(115,'2026-02-10 10:40:50','2026-02-10 10:40:50',298,'2026-02-21','06:00:00','18:00:00','2','2','24',3,1,'2026-01-03',21,NULL,2,1,NULL),(116,'2026-02-10 10:43:55','2026-02-10 10:43:55',298,'2026-02-26','06:00:00','18:00:00','2','2','24',9,1,'2026-01-03',18,NULL,2,1,NULL),(117,'2026-02-10 13:49:30','2026-02-10 13:49:30',298,'2026-02-21','06:00:00','18:00:00','2','1','24',NULL,1,'2026-01-03',19,NULL,2,1,NULL),(118,'2026-02-10 13:49:52','2026-02-10 13:49:52',298,'2026-02-26','06:00:00','17:00:00','2','1','24',NULL,1,'2026-01-03',18,NULL,2,1,NULL),(119,'2026-02-10 14:19:12','2026-02-10 14:19:12',298,'2026-02-26','09:00:00','12:00:00','2','1','24',NULL,1,'2026-01-03',18,NULL,2,1,NULL);
/*!40000 ALTER TABLE `records` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `relationships_with_clinic_user`
--

DROP TABLE IF EXISTS `relationships_with_clinic_user`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `relationships_with_clinic_user` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `created_at` datetime NOT NULL DEFAULT current_timestamp(),
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `relationship` varchar(255) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='利用者との続柄';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `relationships_with_clinic_user`
--

LOCK TABLES `relationships_with_clinic_user` WRITE;
/*!40000 ALTER TABLE `relationships_with_clinic_user` DISABLE KEYS */;
INSERT INTO `relationships_with_clinic_user` VALUES (1,'2025-10-15 15:13:51','2025-10-15 15:13:51','本人'),(2,'2025-10-15 15:13:51','2025-10-15 15:13:51','家族');
/*!40000 ALTER TABLE `relationships_with_clinic_user` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `reports`
--

DROP TABLE IF EXISTS `reports`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `reports` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `created_at` datetime NOT NULL DEFAULT current_timestamp(),
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `clinic_user_id` int(11) NOT NULL,
  `service_provide_month` date NOT NULL,
  `subjective_symptom_and_wish` varchar(1000) DEFAULT NULL,
  `objective_symptom` varchar(1000) DEFAULT NULL,
  `therapy_content` varchar(1000) DEFAULT NULL,
  `therapy_plan` varchar(1000) DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `reports_clinic_users_FK` (`clinic_user_id`),
  CONSTRAINT `reports_clinic_users_FK` FOREIGN KEY (`clinic_user_id`) REFERENCES `clinic_users` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=10 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='報告書データ';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `reports`
--

LOCK TABLES `reports` WRITE;
/*!40000 ALTER TABLE `reports` DISABLE KEYS */;
INSERT INTO `reports` VALUES (1,'2025-12-04 12:30:04','2025-12-04 12:30:04',157,'2024-12-01','腰痛が続いている。痛みを和らげたい。','腰部に圧痛あり。可動域制限が見られる。','あんま・マッサージ施術。温罨法実施。','週2回の施術を継続。3ヶ月後の改善を目指す。'),(5,'2025-12-04 13:36:59','2025-12-05 10:21:46',298,'2025-12-01','Lorem ipsum dolor sit amet, consectetur adipiscing elit.','Lorem ipsum dolor sit amet, consectetur adipiscing elit.  Lorem ipsum dolor sit amet, consectetur adipiscing elit.','Lorem ipsum dolor sit amet, consectetur adipiscing elit.  Lorem ipsum dolor sit amet, consectetur adipiscing elit.  Lorem ipsum dolor sit amet, consectetur adipiscing elit.','Lorem ipsum dolor sit amet, consectetur adipiscing elit.  Lorem ipsum dolor sit amet, consectetur adipiscing elit.  Lorem ipsum dolor sit amet, consectetur adipiscing elit.  Lorem ipsum dolor sit amet, consectetur adipiscing elit.'),(7,'2025-12-04 14:11:24','2025-12-04 14:11:24',298,'2025-11-01','あいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこさしすせそあいうえおかきくけこ','アイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコサシスセソアイウエオカキクケコ','ABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJKLMNOABCDEFGHIJ','abcdefghijklmnoabcdefghijklmnoabcdefghijklmnoabcdefghijklmnoabcdefghijklmnoabcdefghijklmnoabcdefghijklmnoabcdefghijklmnoabcdefghijklmnoabcdefghijklmnoabcdefghijklmnoabcdefghijklmnoabcdefghijklmnoabcdefghijklmnoabcdefghijklmnoabcdefghijklmnoabcdefghijklmnoabcdefghijklmnoabcdefghijklmnoabcdefghijklmnoabcdefghijklmnoabcdefghijklmnoabcdefghijklmnoabcdefghijklmnoabcdefghijklmnoabcdefghijklmnoabcdefghijklmnoabcdefghijklmnoabcdefghijklmnoabcdefghijklmnoabcdefghijklmnoabcdefghijklmnoabcdefghijklmnoabcdefghijklmnoabcdefghijklmnoabcdefghijklmnoabcdefghijklmnoabcdefghijklmnoabcdefghijklmnoabcdefghijklmnoabcdefghijklmnoabcdefghijklmnoabcdefghijklmnoabcdefghijklmnoabcdefghijklmnoabcdefghijklmnoabcdefghijklmnoabcdefghijklmnoabcdefghijklmnoabcdefghijklmnoabcdefghijklmnoabcdefghijklmnoabcdefghijklmnoabcdefghijklmnoabcdefghijklmnoabcdefghijklmnoabcdefghijklmnoabcdefghijklmnoabcdefghijklmnoabcdefghijklmnoabcdefghijklmnoabcdefghijklmnoabcdefghijklmnoabcdefghijklmnoabcdefghijklmnoabcdefghijklmnoabcdefghij'),(9,'2026-02-26 14:10:09','2026-02-26 14:10:09',298,'2026-02-01','2026年02月の報告書テスト2026年02月の報告書テスト','2026年02月の報告書テスト2026年02月の報告書テスト2026年02月の報告書テスト2026年02月の報告書テスト','2026年02月の報告書テスト2026年02月の報告書テスト2026年02月の報告書テスト2026年02月の報告書テスト2026年02月の報告書テスト2026年02月の報告書テスト2026年02月の報告書テスト2026年02月の報告書テスト','2026年02月の報告書テスト2026年02月の報告書テスト2026年02月の報告書テスト2026年02月の報告書テスト2026年02月の報告書テスト2026年02月の報告書テスト2026年02月の報告書テスト2026年02月の報告書テスト2026年02月の報告書テスト2026年02月の報告書テスト2026年02月の報告書テスト2026年02月の報告書テスト2026年02月の報告書テスト2026年02月の報告書テスト2026年02月の報告書テスト2026年02月の報告書テスト');
/*!40000 ALTER TABLE `reports` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `self_fees`
--

DROP TABLE IF EXISTS `self_fees`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `self_fees` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `created_at` datetime NOT NULL DEFAULT current_timestamp(),
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `self_fee_name` varchar(255) NOT NULL,
  `amount` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='自費施術料金';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `self_fees`
--

LOCK TABLES `self_fees` WRITE;
/*!40000 ALTER TABLE `self_fees` DISABLE KEYS */;
INSERT INTO `self_fees` VALUES (1,'2025-11-19 11:34:23','2026-01-17 14:30:40','自費施術０１',1000),(2,'2025-11-19 11:34:23','2026-01-17 14:30:33','自費施術０２',2000),(3,'2025-11-19 11:34:23','2026-01-17 14:30:24','自費施術０３',3000);
/*!40000 ALTER TABLE `self_fees` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `self_or_family`
--

DROP TABLE IF EXISTS `self_or_family`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `self_or_family` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `created_at` datetime NOT NULL DEFAULT current_timestamp(),
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `subject_type` varchar(255) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='本人・家族';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `self_or_family`
--

LOCK TABLES `self_or_family` WRITE;
/*!40000 ALTER TABLE `self_or_family` DISABLE KEYS */;
INSERT INTO `self_or_family` VALUES (1,'2025-10-15 15:09:46','2025-10-15 15:09:46','本人'),(2,'2025-10-15 15:09:46','2025-10-15 15:09:46','六歳'),(3,'2025-10-15 15:09:46','2025-10-15 15:09:46','家族'),(4,'2025-10-15 15:09:46','2025-10-15 15:09:46','高齢１'),(5,'2025-10-15 15:09:46','2025-10-15 15:09:46','高齢'),(6,'2025-10-15 15:09:46','2025-10-15 15:09:46','高齢７');
/*!40000 ALTER TABLE `self_or_family` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `self_paid_fees`
--

DROP TABLE IF EXISTS `self_paid_fees`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `self_paid_fees` (
  `id` bigint(20) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(255) NOT NULL,
  `amount` int(11) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `self_paid_fees`
--

LOCK TABLES `self_paid_fees` WRITE;
/*!40000 ALTER TABLE `self_paid_fees` DISABLE KEYS */;
/*!40000 ALTER TABLE `self_paid_fees` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `service_providers`
--

DROP TABLE IF EXISTS `service_providers`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `service_providers` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `created_at` datetime NOT NULL DEFAULT current_timestamp(),
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `service_provider_name` varchar(255) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='サービス事業者名';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `service_providers`
--

LOCK TABLES `service_providers` WRITE;
/*!40000 ALTER TABLE `service_providers` DISABLE KEYS */;
INSERT INTO `service_providers` VALUES (1,'2025-11-14 10:54:42','2025-11-14 10:54:42','AAAAA'),(2,'2025-11-14 10:55:04','2025-11-14 10:55:04','AAAAA'),(3,'2025-11-14 10:58:12','2025-11-14 10:58:12','BBBBB'),(4,'2025-11-14 14:09:55','2025-11-14 14:09:55','CCCCC');
/*!40000 ALTER TABLE `service_providers` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `sessions`
--

DROP TABLE IF EXISTS `sessions`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `sessions` (
  `id` varchar(255) NOT NULL,
  `user_id` bigint(20) unsigned DEFAULT NULL,
  `ip_address` varchar(45) DEFAULT NULL,
  `user_agent` text DEFAULT NULL,
  `payload` longtext NOT NULL,
  `last_activity` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `sessions`
--

LOCK TABLES `sessions` WRITE;
/*!40000 ALTER TABLE `sessions` DISABLE KEYS */;
INSERT INTO `sessions` VALUES ('LCThJ1BbIyPr02a1XT7p3UmMH4e209hxJylGMZHg',1,'127.0.0.1','Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/142.0.0.0 Safari/537.36','YTo0OntzOjY6Il90b2tlbiI7czo0MDoiSWdkc2Y0VElyMUdOcWYzTU92N2l3cWpsWmd1T3NEWDN2aUV6aXZSWCI7czo5OiJfcHJldmlvdXMiO2E6MTp7czozOiJ1cmwiO3M6MjE6Imh0dHA6Ly8xMjcuMC4wLjE6ODAwMCI7fXM6NjoiX2ZsYXNoIjthOjI6e3M6Mzoib2xkIjthOjA6e31zOjM6Im5ldyI7YTowOnt9fXM6NTA6ImxvZ2luX3dlYl81OWJhMzZhZGRjMmIyZjk0MDE1ODBmMDE0YzdmNThlYTRlMzA5ODlkIjtpOjE7fQ==',1762308569),('MyjqpFthzLl07QVNHG5gfn1NZUiEaz7I6dc2ZXA6',1,'127.0.0.1','Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/142.0.0.0 Safari/537.36','YTo0OntzOjY6Il90b2tlbiI7czo0MDoiQ0w0WmE0c2NJaWNIVmhrOGRCRnZOcmhqbWpTaHhYTDhybGREYUx5NSI7czo1MDoibG9naW5fd2ViXzU5YmEzNmFkZGMyYjJmOTQwMTU4MGYwMTRjN2Y1OGVhNGUzMDk4OWQiO2k6MTtzOjk6Il9wcmV2aW91cyI7YToxOntzOjM6InVybCI7czo4MToiaHR0cDovLzEyNy4wLjAuMTo4MDAwL2NsaW5pYy11c2Vycy1pbmZvL2N1aS1jb25zZW50aW5nLWRvY3Rvci1oaXN0b3J5LW1hc3NhZ2UvMTU2Ijt9czo2OiJfZmxhc2giO2E6Mjp7czozOiJvbGQiO2E6MDp7fXM6MzoibmV3IjthOjA6e319fQ==',1762306548),('TkknSRTTuOkGDVfQWprqj0C0S9t1puW1Kii2IAIO',1,'127.0.0.1','Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/142.0.0.0 Safari/537.36 Edg/142.0.0.0','YTo0OntzOjY6Il90b2tlbiI7czo0MDoiSTZ6TkRiRDFXNnJaS3Vab1Fic0RFeTR0Y25lakNQQnNqenMzSTcwYiI7czo5OiJfcHJldmlvdXMiO2E6MTp7czozOiJ1cmwiO3M6MjE6Imh0dHA6Ly8xMjcuMC4wLjE6ODAwMCI7fXM6NjoiX2ZsYXNoIjthOjI6e3M6Mzoib2xkIjthOjA6e31zOjM6Im5ldyI7YTowOnt9fXM6NTA6ImxvZ2luX3dlYl81OWJhMzZhZGRjMmIyZjk0MDE1ODBmMDE0YzdmNThlYTRlMzA5ODlkIjtpOjE7fQ==',1762308079);
/*!40000 ALTER TABLE `sessions` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `system_users`
--

DROP TABLE IF EXISTS `system_users`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `system_users` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `created_at` datetime NOT NULL DEFAULT current_timestamp(),
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `name` varchar(255) NOT NULL,
  `login_id` varchar(255) NOT NULL,
  `password` varchar(255) NOT NULL,
  `remember_token` varchar(255) DEFAULT NULL,
  `last_login_at` timestamp NULL DEFAULT NULL COMMENT '前回ログイン日時',
  `comment` varchar(255) DEFAULT 'NULL',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='システムユーザー（システム管理者が作成）';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `system_users`
--

LOCK TABLES `system_users` WRITE;
/*!40000 ALTER TABLE `system_users` DISABLE KEYS */;
INSERT INTO `system_users` VALUES (1,'2025-09-19 11:37:39','2026-02-26 10:32:27','SystemUser-01','test1','$2y$12$s185XH3nYYAy9g4MJUnk9OThXofg9gwugWbIuwXbEKvdh5r5aovTG','Hfiz59RVay3PeTLDpAbE6UJU1ZunDFMRwFJtpRSvwVlgpHEqZ4hQL68ymOme','2026-02-26 01:32:27','パスワード平文：test1');
/*!40000 ALTER TABLE `system_users` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `therapists`
--

DROP TABLE IF EXISTS `therapists`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `therapists` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `created_at` datetime NOT NULL DEFAULT current_timestamp(),
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `last_name` varchar(255) DEFAULT NULL,
  `first_name` varchar(255) DEFAULT NULL,
  `last_name_kana` varchar(255) DEFAULT NULL,
  `first_name_kana` varchar(255) DEFAULT NULL,
  `postal_code` varchar(255) DEFAULT NULL,
  `address_1` varchar(255) DEFAULT NULL,
  `address_2` varchar(255) DEFAULT NULL,
  `address_3` varchar(255) DEFAULT NULL,
  `phone` varchar(255) DEFAULT NULL,
  `cell_phone` varchar(255) DEFAULT NULL,
  `fax` varchar(255) DEFAULT NULL,
  `email` varchar(255) DEFAULT NULL,
  `license_hari_code_number` bigint(20) DEFAULT NULL,
  `license_hari_issued_date` date DEFAULT NULL,
  `license_kyu_code_number` bigint(20) DEFAULT NULL,
  `license_kyu_issued_date` date DEFAULT NULL,
  `license_massage_code_number` bigint(20) DEFAULT NULL,
  `license_massage_issued_date` date DEFAULT NULL,
  `member_number` bigint(20) DEFAULT NULL,
  `note` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `therapists_license_FK` (`license_hari_code_number`),
  KEY `therapists_license_FK_1` (`license_kyu_code_number`),
  KEY `therapists_license_FK_2` (`license_massage_code_number`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='施術者';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `therapists`
--

LOCK TABLES `therapists` WRITE;
/*!40000 ALTER TABLE `therapists` DISABLE KEYS */;
INSERT INTO `therapists` VALUES (1,'2025-11-13 14:00:17','2026-01-30 15:27:48','瀬良','日須戸','セラ','ピスト','880-0004','宮崎県','宮崎市元宮町','AAAAA','1212125','12125','01000125','AAAAA@AAAAA',100011,'2025-11-01',100012,'2025-11-01',100013,'2025-11-01',100014,'施術者情報メモテスト'),(2,'2025-12-06 13:43:25','2026-01-30 15:29:22','施術者','02',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,200011,NULL,200012,NULL,200013,NULL,200014,NULL),(3,'2025-12-06 13:43:59','2026-01-30 15:29:38','施術者','03',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,300011,NULL,300012,NULL,300013,NULL,300014,NULL);
/*!40000 ALTER TABLE `therapists` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `therapy_contents`
--

DROP TABLE IF EXISTS `therapy_contents`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `therapy_contents` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `therapy_type` tinyint(4) NOT NULL COMMENT '1:はり･きゅう, 2:あんま･マッサージ',
  `created_at` datetime NOT NULL DEFAULT current_timestamp(),
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `therapy_content` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=22 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='施術内容';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `therapy_contents`
--

LOCK TABLES `therapy_contents` WRITE;
/*!40000 ALTER TABLE `therapy_contents` DISABLE KEYS */;
INSERT INTO `therapy_contents` VALUES (11,1,'2026-01-08 11:36:19','2026-01-08 11:36:19','はり'),(12,1,'2026-01-08 11:36:19','2026-01-08 11:36:19','きゅう'),(13,1,'2026-01-08 11:36:19','2026-01-08 11:36:19','はり･きゅう併用'),(14,1,'2026-01-08 11:36:19','2026-01-08 11:36:19','電療（電気針）'),(15,1,'2026-01-08 11:36:19','2026-01-08 11:36:19','電療（電気温灸器）'),(16,1,'2026-01-08 11:36:19','2026-01-08 11:36:19','電療（電気光線器具）'),(18,2,'2026-01-08 11:36:19','2026-01-08 11:36:19','マッサージ'),(19,2,'2026-01-08 11:36:19','2026-01-08 11:36:19','変形徒手矯正術'),(20,2,'2026-01-08 11:36:19','2026-01-08 11:36:19','温罨法'),(21,2,'2026-01-08 11:36:19','2026-01-08 11:36:19','温罨法･電気光線器具');
/*!40000 ALTER TABLE `therapy_contents` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `treatment_fees`
--

DROP TABLE IF EXISTS `treatment_fees`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `treatment_fees` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `created_at` datetime NOT NULL DEFAULT current_timestamp(),
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `hari_first` int(11) DEFAULT NULL,
  `hari_normal` int(11) DEFAULT NULL,
  `hari_and_elec_needle_first` int(11) DEFAULT NULL,
  `hari_and_elec_needle_normal` int(11) DEFAULT NULL,
  `kyu_first` int(11) DEFAULT NULL,
  `kyu_normal` int(11) NOT NULL,
  `kyu_and_elec_moxa_heater_first` int(11) DEFAULT NULL,
  `kyu_and_elec_moxa_heater_normal` int(11) DEFAULT NULL,
  `hari_and_kyu_first` int(11) DEFAULT NULL,
  `hari_and_kyu_normal` int(11) DEFAULT NULL,
  `hari_and_kyu_elec_ray_first` int(11) DEFAULT NULL,
  `hari_and_kyu_elec_ray_normal` int(11) DEFAULT NULL,
  `housecall_max_2km_first` int(11) DEFAULT NULL,
  `housecall_max_2km_normal` int(11) DEFAULT NULL,
  `housecall_additional_max_4km_first` int(11) DEFAULT NULL,
  `housecall_additional_max_4km_normal` int(11) DEFAULT NULL,
  `massage_trunk_first` int(11) NOT NULL,
  `massage_trunk_normal` int(11) NOT NULL,
  `massage_upper_limb_r_first` int(11) NOT NULL,
  `massage_upper_limb_r_normal` int(11) NOT NULL,
  `massage_upper_limb_l_first` int(11) NOT NULL,
  `massage_upper_limb_l_normal` int(11) NOT NULL,
  `massage_lower_limb_r_first` int(11) NOT NULL,
  `massage_lower_limb_r_normal` int(11) NOT NULL,
  `massage_lower_limb_l_first` int(11) NOT NULL,
  `massage_lower_limb_l_normal` int(11) NOT NULL,
  `manual_correction_first` int(11) NOT NULL,
  `manual_correction_normal` int(11) NOT NULL,
  `fomentation_first` int(11) NOT NULL,
  `fomentation_normal` int(11) NOT NULL,
  `fomentation_and_elec_ray_first` int(11) NOT NULL,
  `fomentation_and_elec_ray_normal` int(11) NOT NULL,
  `period_start` date NOT NULL,
  `period_end` date NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='施術料金';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `treatment_fees`
--

LOCK TABLES `treatment_fees` WRITE;
/*!40000 ALTER TABLE `treatment_fees` DISABLE KEYS */;
INSERT INTO `treatment_fees` VALUES (1,'2025-11-15 15:25:58','2025-12-19 11:34:39',1000,1500,2500,3000,1500,2000,3000,3500,2000,2500,3500,4000,200,400,400,600,1000,1500,1500,2000,2000,2500,2500,3000,3000,3500,3500,4000,4000,2000,4500,5000,'2025-10-01','2025-12-31');
/*!40000 ALTER TABLE `treatment_fees` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `users`
--

DROP TABLE IF EXISTS `users`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `users` (
  `id` bigint(20) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(255) NOT NULL,
  `email` varchar(255) NOT NULL,
  `email_verified_at` timestamp NULL DEFAULT NULL,
  `password` varchar(255) NOT NULL,
  `remember_token` varchar(100) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `users_email_unique` (`email`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `users`
--

LOCK TABLES `users` WRITE;
/*!40000 ALTER TABLE `users` DISABLE KEYS */;
/*!40000 ALTER TABLE `users` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `work_scope_types`
--

DROP TABLE IF EXISTS `work_scope_types`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `work_scope_types` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `created_at` datetime NOT NULL DEFAULT current_timestamp(),
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `work_scope_type` varchar(255) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='業務上外等区分';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `work_scope_types`
--

LOCK TABLES `work_scope_types` WRITE;
/*!40000 ALTER TABLE `work_scope_types` DISABLE KEYS */;
INSERT INTO `work_scope_types` VALUES (1,'2025-09-10 11:25:25','2025-09-10 11:25:25','業務上'),(2,'2025-09-10 11:25:25','2025-09-10 11:25:25','第三者行為である'),(3,'2025-09-10 11:25:25','2025-09-10 11:25:25','その他');
/*!40000 ALTER TABLE `work_scope_types` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2026-02-27 12:35:35
